Angle145/FSC_STOS/新版：FSC-OS/FSC-OS_V1.0.2_Beta_STM32F10x/User/STM32F10xPeripMode.h
#ifndef _STM32F10xPeripMode_H_
#define _STM32F10xPeripMode_H_
#include "stm32f10x.h"
#include <stdio.h>
#include "STM32F10x_C51Mode.h" //位带绑定IO操作，用于RS485使能发送接收引脚(如用不到ModBus模块可不必包含此头文件)

/*+++++++++++++++++++++++++++++++++++++++++++++++供用户调用的外设函数+++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define MODE_UNUSE 0
#define MODE_USE   1
//重要说明：每个模块第一个宏定义为模块开关 0 - 不使用  1 - 使用

/****************************************************外部中断模块*****************************************************************/
//示例: EXTI_Config(GPIOB,GPIO_Pin_5,0);//PB5用作外部中断引脚,0-下降沿触发中断，1-上升沿触发中断，2-下降沿/上升沿触发中断
#define USE_EXTI  0     //0--不使用外部中断  1--使用
#if (USE_EXTI == 1)
void EXTI_Config(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x,uint8_t EXTI_Trigger_Mode);//外部中断引脚初使化
#endif 

/****************************************************定时器模块*******************************************************************/ 
//示例：TIMER_Config(TIM2,50000);//使用定时器2，定时50ms 定时最大值65535us (TIM1产生PWM，如使用PWM，则TIM1不能用作定时器)
//      TIMER__Config(TIM2,72,1000);//使用定时器2，定时器频率设为72M/72=1M,计时1000次。(72MHz是stm32f1主频，一般为固定值)
//      TIMx  =   TIM1、TIM2、TIM3、TIM4   共4个 (目前重封装库函数仅支持4个定时器)
//      取值范围： Prescaler : 1-65535   ,   Period  :  1-65535
#define USE_TIMER  1   //0--不使用定时器  1--使用
#if (USE_TIMER == 1)
void TIMER_Config(TIM_TypeDef* TIMx,uint16_t TimePeriod);//定时器初使化(TimePeriod=1-65535,单位:us)
void TIMER_Reload(TIM_TypeDef* TIMx,uint16_t Period); //设置自动重装载定时值
void TIMER__Config(TIM_TypeDef* TIMx,uint16_t Prescaler,uint16_t Period);//定时器频率(主频)可调的定时器初使化
void TIMER__Reload(TIM_TypeDef* TIMx,uint16_t Prescaler,uint16_t Period);//定时器频率(主频)可调的设置自动重装载定时值
void TIMER_ON(TIM_TypeDef* TIMx); //打开定时器   例：TIMER_ON(TIM2);//打开定时器2
void TIMER_OFF(TIM_TypeDef* TIMx);//关闭定时器   例：TIMER_OFF(TIM2);//关闭定时器2
#endif 
//PS:Prescaler参数为stm32主频分频给定时器作为主频的分频系数值。Period为定时器计数次数，计数完成后会产生一次中断表示定时完成。


/******************************************************串口模块*******************************************************************/  
//示例：USART1_Config(9600);//波特率：9600，常用的波特率均有效
#define USE_USART                 1     //0--不使用串口  1--使用
#if (USE_USART == 1)
#define printf_use_usartx         1     //printf  串口选择 1-usart1、1-usart2、3-usart3 
#define USART_RX_BUFF_LEN         256   //接收缓存长度
#define USART_TX_BUFF_LEN         32    //发送缓存长度
typedef struct
{
	uint8_t RX_BUFF[USART_RX_BUFF_LEN];  //接收缓存
	uint8_t TX_BUFF[USART_TX_BUFF_LEN];  //发送缓存
	uint32_t ByteCnt;                 //字节计数(用于接收，当检测它>0时表示有接收到数据,处理完接收数据要把它清0)
}TypeUsart;
TypeUsart Usart1,Usart2,Usart3;  //3个串口数据结构体
void USART1_Config(u32 baudRate);//串口1初使化         //默认  1位停止，数据位8位，无奇偶校验，用到其他可到函数内部修改
void USART2_Config(u32 baudRate);//串口2初使化         //默认  1位停止，数据位8位，无奇偶校验，用到其他可到函数内部修改
void USART3_Config(u32 baudRate);//串口3初使化         //默认  1位停止，数据位8位，无奇偶校验，用到其他可到函数内部修改
//串口1: TX:PA9  RX:PA10
void USART1_SendByte(uint8_t onebyte);//串口1发送一个字节
void USART1_Send(uint8_t *p,uint16_t len);//串口1发送多个字节(适用数组)
void USART1_SendStr(uint8_t *str);    //串口1发送字符串(仅适用字符串)
uint8_t USART1_ReadByte(void);        //串口1读取接收的一个字节
uint8_t* USART1_Read(uint16_t len);//串口1读取接收的多个字节
char* USART1_ReadStr(void);//串口1读取接收的字符串

//串口2: TX:PA2  RX:PA3
void USART2_SendByte(uint8_t onebyte); //串口2发送一个字节
void USART2_Send(uint8_t *p,uint16_t len);//串口2发送多个字节(适用数组)
void USART2_SendStr(uint8_t *str);     //串口2发送字符串(仅适用字符串) 
uint8_t USART2_ReadByte(void);         //串口2读取接收的一个字节
uint8_t* USART2_Read(uint16_t len);//串口1读取接收的多个字节
char* USART2_ReadStr(void);//串口2读取接收的字符串

//串口3: TX:PB10  RX:PB11
void USART3_SendByte(uint8_t onebyte); //串口3发送一个字节
void USART3_Send(uint8_t *p,uint16_t len);//串口3发送多个字节(适用数组)
void USART3_SendStr(uint8_t *str);     //串口3发送字符串(仅适用字符串) 
uint8_t USART3_ReadByte(void);         //串口3读取接收的一个字节
uint8_t* USART3_Read(uint16_t len);//串口1读取接收的多个字节
char* USART3_ReadStr(void);//串口3读取接收的字符串

void STM32F10xPeripMode_Usart1RxCheck(void);//放在串口1中断函数里，串口检测（放在中断函数最前面）
void STM32F10xPeripMode_Usart2RxCheck(void);//放在串口2中断函数里，串口检测（放在中断函数最前面）
void STM32F10xPeripMode_Usart3RxCheck(void);//放在串口3中断函数里，串口检测（放在中断函数最前面）

void STM32F10xPeripMode_Usart1_UsartReceiveByte(uint8_t UsartRxByte); //放在串口1中断函数里，输入形参为接收的1字节数据
void STM32F10xPeripMode_Usart2_UsartReceiveByte(uint8_t UsartRxByte); //放在串口2中断函数里，输入形参为接收的1字节数据
void STM32F10xPeripMode_Usart3_UsartReceiveByte(uint8_t UsartRxByte); //放在串口3中断函数里，输入形参为接收的1字节数据
#endif


/*************************************************ADC模块(12bit ADC)***********************************************************/  
//PA0-PA7,PB0,PB1,PC0-PC5共16个引脚
#define USE_ADC  0     //0--不使用ADC  1--使用
#if (USE_ADC == 1)
void ADC_Config(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x);//ADC初使化
float ReadADC_Volt(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x);//读取ADC转换的电压值(0-3.3000)
uint16_t ReadADC_Hex(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x);//读取ADC转换的数值(0-4095)
#endif

/*************************************************DAC模块(12bit DAC)***********************************************************/
//PA4、PA5共2个引脚
#define USE_DAC  0     //0--不使用DAC  1--使用
#if (USE_DAC == 1)
void DAC_Config(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x);//DAC初使化
void WriteDAC_Volt(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x,float volt);//设置DAC电压值(0-3.3000)
void WriteDAC_Hex(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x,uint16_t hex);//设置DAC整型值(0-4095)
#endif

/*************************************************PWM脉宽调制模块***********************************************************/
//输出PWM引脚：单路PA8 ，双路互补：PA8、PB13
#define USE_PWM  0       //0--不使用PWM  1--使用
#if (USE_PWM == 1)
void PWM_TIM1_Config(uint16_t Prescaler,uint16_t Period,uint16_t Pulse);//单路PWM输出
void PWM_TIM1_OC_Config(uint16_t Prescaler,uint16_t Period,uint16_t Pulse,uint8_t DTime);//双路互补PWM输出(带死区)
void PWM_TIM1_ON(void); //打开PWM输出
void PWM_TIM1_OFF(void);//关闭PWM输出
void PWM_TIM1_OC_ON(void); //打开双路PWM输出
void PWM_TIM1_OC_OFF(void);//关闭双路PWM输出
#endif

/*****************************************************频率计模块***********************************************************/
#define USE_FREQMETER         0     //1--使用频率计 0--不使用
#if (USE_FREQMETER == 1)
#define USE_FREQMETER_PRINTF  1     //1--使用串口打印输出频率计信息  0--不使用
#define FREQMETER_PRINTF_TIME 5000  //串口发送延时时间
typedef struct 
{
	uint32_t FreqCh[4];//通道频率
  uint8_t DutyCh[4];//通道占空比 (0-100)
}FREQMETER;
FREQMETER FreqMeter;  //频率计输出数据  
//输入参数分别为:分频系数,输入通道数量
void FreqMeter_TIM2(uint16_t Prescaler,uint8_t CHNum);//CH1:PA0  CH2:PA1  CH3:PA2  CH4:PA3 
void FreqMeter_ON(void);  //打开频率计
void FreqMeter_OFF(void); //关闭频率计
#endif

