Angle145/FSC_STOS/新版：FSC-OS/FSC-OS_V1.0.2_Beta_STM32F10x/User/STM32F10xPeripMode.h
/*********************************************ModBusRTU 主站功能模块*******************************************************/
//读取数据时，接收的数据保存在RS485,RX_BUFF[]缓存数组里，最大接收长度RS485_BUFF_LEN
#define USE_MODEBUS     0      //0--不使用modbus 1--使用
#if (USE_MODEBUS == 1)
#define RS485_USARTTx   2      //=1使用串口1作为RS485发送,=2 USART2  =3 USART3
#define RS485_USARTRx   2      //=1使用串口1作为RS485接收,=2 USART2  =3 USART3
#define RS485_BUFF_LEN  32     //接收和发送缓存长度1-255(最大255)
#define RS485_EN        PB15   //默认PB15为RS485使能引脚（可根据实际需要修改,需要位带绑定IO操作）

TypeUsart RS485;        //串口结构体定义RS485类型发送和接收缓存
typedef struct
{
	/***************用户需要操作的值*******************/
	uint8_t  SlaveID;  //设备ID 8bit         //从机码
	uint8_t  Function;  //功能 8bit          //功能码
	uint16_t Address;   //数据地址 16bit     //数据地址码
	uint16_t Word;      //数据/数量 16bit    //数据码
	uint16_t WordNum;   //读取数据个数 16bit //数据个数码(仅读取数据时使用)
	uint16_t RegNum;    //寄存器数量 16bit   //寄存器数量码(仅对多个寄存器操作时使用)
  uint8_t  ByteNum;   //字节数 8bit        //多寄存器或多对象操作时的字节数码(读或写都使用这个)
	uint8_t  BUFF[RS485_BUFF_LEN];  //多个数据放在此处 8bit ,如果多寄存器读写的数量超过16可修改为更大的值（同时也要修改串口接收缓存的大小，前提是单片机内存足够）
	/**************************************************/
	uint16_t CRC16;   
	uint8_t  EnFlag;  
	uint8_t  FshFlag;
	uint8_t  ErrFlag;
	uint8_t  ByteCnt; 
  uint8_t  WordCnt; 	
}modbusRTU;
modbusRTU ModBusRTU_TX; //发送和接收缓存
void ModBusRTU_Config(void);   //ModBus初使化
void ModBusRTU_Send(modbusRTU modbus);  //发送modbusRTU结构体类型格式的数据(无需要输入CRC数据，函数会自动计算和发送CRC)
void ModBusRTU_SendCmd(uint8_t *p,uint16_t len);//发送自定义数组结构类型格式的数据(无需要输入CRC数据，函数会自动计算和发送CRC)

void STM32F10xPeripMode_ModeBusRTU_UsartReceiveByte(uint8_t UsartRxByte);//放在需要的串口中断里，需要哪个串口就放在哪个串口中断
#endif


/****************************************************数据处理模块**********************************************************/
#define USE_DigHand  0      //0--不使用数据处理，1--使用
#if (USE_DigHand == 1)
//阶梯数字滤波算法:                     //用于增量控制
double Ladder(double step,double value);//过滤掉增量小于step的值,输出值是step的倍数值
//带通数字滤波算法：                   //km增长率调节，在1.000附近适当取值。
double BandPass_M(double km,double max,double value); //过滤掉max以上的值
double BandPass_L(double km,double min,double value); //过滤掉min以下的值
double BandPass_ML(double km,double min,double max,double value); //过滤掉min以下的值且过滤掉max以上的值
double BandPass_MLN(double km,double min,double max,double value); //过滤掉min-max范围内的值
//卡尔曼数字滤波算法：
/*      Q:过程噪声，Q增大，动态响应变快，收敛稳定性变坏,参考值：0.02
        R:测量噪声，R增大，动态响应变慢，收敛稳定性变好，参考值：7.0000    */ 
double KalmanFilter(double ProcessNiose_Q,double MeasureNoise_R,const double ResrcData);//ResrcData-保存采集信号的变量(静态常量，常驻内存)
#endif


/****************************************************内部Flash模块**********************************************************/
//重要的数据变化之后调用此模块把数据保存到内部flash
#define USE_FLASHWR   0       //0--不使用内部flash读写  1--使用
#if  (USE_FLASHWR == 1)
void FLASH_WriteNWord(uint16_t *pBuffer, uint32_t WriteAddr, uint16_t nWord);//向内部flash写n个字节
void FLASH_ReadNWord(uint16_t *pBuffer, uint32_t ReadAddr, uint16_t nWord);//向内部flash读取n个字节
#endif


/****************************************************独立看门狗模块**********************************************************/
//防止死机
#define USE_IWDG 0           //0--不使用看门狗  1--使用
#if  (USE_IWDG == 1)
void IWDG_Config(uint16_t nms);//独立看门狗初使化，参数：喂狗超时时间(ms)，范围：2ms-2000ms
void IWDG_Feed(void);//喂狗   (在超时前喂狗)
#endif


/****************************************************断电检测模块**********************************************************/
//电压范围：2.2V-2.9V  (检测到芯片电压低于电压阀值时产生掉电中断,在中断里做紧急处理)
#define USE_BKP   0          //0--不使用断电检测  1--使用
#if  (USE_BKP == 1)
void BKP_Config(float voltage); //初使化函数 示例：BKP_Config(2.7); //芯片低于2.7V时产生掉电中断 (掉电中断函数  PVD_IRQHandler() 在本页底部)
#endif
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/


/*++++++++++++++++++++++++++++++++++++++++++++++++具体说明++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/

/*
//以下计算是基于系统时钟为72MHz，如为其他频率，请将72000000Hz换成实际频率即可
模块使用示例：
  
1.PWM模块
  示例1：PWM_TIM1_Config(参数1,参数2,参数3);
	                 **参数1：分频系数1
									 **参数2: 分频系数2  
									 **参数3: 占空值     (占空比=参数3/参数2)
									 
				          三个参数的取值范围均为:0-65535
									PWM输出频率=72MHz/分频系数1/分频系数2
									
  示例2：PWM_TIM1_OC_Config(参数1,参数2,参数3,参数4);
		               **参数1：分频系数1
									 **参数2: 分频系数2  
									 **参数3: 占空值             占空比=参数3/参数2
									 **参数4：死区时间**         通过死区计算器算出(在说明-工具文件夹里)


2.内部Flash模块
   提示:flash有擦写次数上限，请慎用此模块(不要频繁使用，警惕无限循环擦写),使用flash作为代码区时，请远离代码范围读写。

   示例：FLASH_WriteNWord((uint16_t*)(&StructMod)，0x00,sizeof(StructMod));//把结构体StructMod数据保存到flash
	       FLASH_ReadNWord((uint16_t*)(&StructMod)，0x00,sizeof(StructMod)); //读取flash中结构体StructMod数据到结构体StructMod

*/



















































/**********************************************外设驱动源码区*************************************************/


/*************************************************外部中断***********************************************************/
/*********************************************************************************
*函数名:EXTI_Config() 外部引脚中断初使化函数
*参数:  GPIOx             -- x=A,B,C,D,E,F      IO口组
        GPIO_Pin_x        -- x=0,1,2,...14,15   IO口引脚号
        EXTI_Trigger_Mode --                    中断触发方式
                              =0 下降沿触发 
                              =1上升沿触发 
                              =2上升沿和下降沿均可触发   
**********************************************************************************/
#if (USE_EXTI == 1)
void EXTI_Config(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x,uint8_t EXTI_Trigger_Mode) //外部中断初使化函数//(用户可调用)
{
	uint32_t RCC_APB2Periph_Source;
	uint8_t  GPIO_PortSource;
	uint8_t  GPIO_PinSource;
	uint32_t EXTI_Line;
	uint8_t  EXTI_IRQn;
	EXTITrigger_TypeDef  EXTI_Trigger;
	
	GPIO_InitTypeDef GPIO_InitStructure;
	EXTI_InitTypeDef EXTI_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	
	if(GPIOx==GPIOA)      { RCC_APB2Periph_Source=RCC_APB2Periph_GPIOA;GPIO_PortSource=GPIO_PortSourceGPIOA;}
	else if(GPIOx==GPIOB) { RCC_APB2Periph_Source=RCC_APB2Periph_GPIOB;GPIO_PortSource=GPIO_PortSourceGPIOB;}
	else if(GPIOx==GPIOC) { RCC_APB2Periph_Source=RCC_APB2Periph_GPIOC;GPIO_PortSource=GPIO_PortSourceGPIOC;}
	else if(GPIOx==GPIOD) { RCC_APB2Periph_Source=RCC_APB2Periph_GPIOD;GPIO_PortSource=GPIO_PortSourceGPIOD;}
	else if(GPIOx==GPIOE) { RCC_APB2Periph_Source=RCC_APB2Periph_GPIOE;GPIO_PortSource=GPIO_PortSourceGPIOE;}
	else if(GPIOx==GPIOF) { RCC_APB2Periph_Source=RCC_APB2Periph_GPIOF;GPIO_PortSource=GPIO_PortSourceGPIOF;}
	else if(GPIOx==GPIOG) { RCC_APB2Periph_Source=RCC_APB2Periph_GPIOG;GPIO_PortSource=GPIO_PortSourceGPIOG;}
	
