Angle145/FSC_STOS/新版：FSC-OS/FSC-OS_V1.0.2_Beta_STM32F10x/User/STM32F10xPeripMode.h
	if(GPIO_Pin_x==GPIO_Pin_0)       { GPIO_PinSource=GPIO_PinSource0; EXTI_Line=EXTI_Line0; EXTI_IRQn=EXTI0_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_1)  { GPIO_PinSource=GPIO_PinSource1; EXTI_Line=EXTI_Line1; EXTI_IRQn=EXTI1_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_2)  { GPIO_PinSource=GPIO_PinSource2; EXTI_Line=EXTI_Line2; EXTI_IRQn=EXTI2_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_3)  { GPIO_PinSource=GPIO_PinSource3; EXTI_Line=EXTI_Line3; EXTI_IRQn=EXTI3_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_4)  { GPIO_PinSource=GPIO_PinSource4; EXTI_Line=EXTI_Line4; EXTI_IRQn=EXTI4_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_5)  { GPIO_PinSource=GPIO_PinSource5; EXTI_Line=EXTI_Line5; EXTI_IRQn=EXTI9_5_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_6)  { GPIO_PinSource=GPIO_PinSource6; EXTI_Line=EXTI_Line6; EXTI_IRQn=EXTI9_5_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_7)  { GPIO_PinSource=GPIO_PinSource7; EXTI_Line=EXTI_Line7; EXTI_IRQn=EXTI9_5_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_8)  { GPIO_PinSource=GPIO_PinSource8; EXTI_Line=EXTI_Line8; EXTI_IRQn=EXTI9_5_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_9)  { GPIO_PinSource=GPIO_PinSource9; EXTI_Line=EXTI_Line9; EXTI_IRQn=EXTI9_5_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_10) { GPIO_PinSource=GPIO_PinSource10;EXTI_Line=EXTI_Line10;EXTI_IRQn=EXTI15_10_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_11) { GPIO_PinSource=GPIO_PinSource11;EXTI_Line=EXTI_Line11;EXTI_IRQn=EXTI15_10_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_12) { GPIO_PinSource=GPIO_PinSource12;EXTI_Line=EXTI_Line12;EXTI_IRQn=EXTI15_10_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_13) { GPIO_PinSource=GPIO_PinSource13;EXTI_Line=EXTI_Line13;EXTI_IRQn=EXTI15_10_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_14) { GPIO_PinSource=GPIO_PinSource14;EXTI_Line=EXTI_Line14;EXTI_IRQn=EXTI15_10_IRQn; }
	else if(GPIO_Pin_x==GPIO_Pin_15) { GPIO_PinSource=GPIO_PinSource15;EXTI_Line=EXTI_Line15;EXTI_IRQn=EXTI15_10_IRQn; }

	/* 开启GPIO时钟 */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_Source,ENABLE);

	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_x;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOx,&GPIO_InitStructure);
	 
	GPIO_EXTILineConfig(GPIO_PortSource, GPIO_PinSource);//选择GPIO管脚用作外部中断线路
	//此处一定要记住给端口管脚加上中断外部线路
	/* 设置外部中断的模式 */ 
	if(EXTI_Trigger_Mode==0)      EXTI_Trigger=EXTI_Trigger_Falling;        //下降沿触发
	else if(EXTI_Trigger_Mode==1) EXTI_Trigger=EXTI_Trigger_Rising;         //上升沿触发
	else if(EXTI_Trigger_Mode==2) EXTI_Trigger=EXTI_Trigger_Rising_Falling; //上升/下降沿触发
	EXTI_InitStructure.EXTI_Line=EXTI_Line;
	EXTI_InitStructure.EXTI_Mode=EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger=EXTI_Trigger; //外部引脚触发方式
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure); 
	
	/* 设置NVIC参数 */	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);		 
	NVIC_InitStructure.NVIC_IRQChannel = EXTI_IRQn; 	//打开EXTI2的全局中断
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0; //抢占优先级为0
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;		  //响应优先级为0
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; 		  //使能
	NVIC_Init(&NVIC_InitStructure); 		
}
#endif



















/*************************************************定时器***********************************************************/
#if (USE_TIMER == 1)
void TIMER_Config(TIM_TypeDef* TIMx,uint16_t TimePeriod) //定时器向上计数，计数1次用时1us，最大655335us
{
	uint32_t RCC_APBPeriph_Source;
	uint8_t TIM_IRQn;
	
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;	 //声明一个结构体变量，用来初始化GPIO
	NVIC_InitTypeDef NVIC_InitStructure;

	TIM_ClearITPendingBit(TIMx,TIM_IT_Update);//清除TIMx的中断待处理位:TIM 中断源
	
	if(TIMx==TIM1)      { RCC_APBPeriph_Source=RCC_APB2Periph_TIM1;TIM_IRQn=TIM1_UP_IRQn; }                      
	else if(TIMx==TIM2) { RCC_APBPeriph_Source=RCC_APB1Periph_TIM2;TIM_IRQn=TIM2_IRQn; }
	else if(TIMx==TIM3) { RCC_APBPeriph_Source=RCC_APB1Periph_TIM3;TIM_IRQn=TIM3_IRQn; }
	else if(TIMx==TIM4) { RCC_APBPeriph_Source=RCC_APB1Periph_TIM4;TIM_IRQn=TIM4_IRQn; }
	
	/* 开启定时器时钟 */
	RCC_APB1PeriphClockCmd(RCC_APBPeriph_Source,ENABLE);
  
	TIM_TimeBaseInitStructure.TIM_Period = TimePeriod-1;//设置自动重装载寄存器周期的值
	TIM_TimeBaseInitStructure.TIM_Prescaler = 72-1;//设置用来作为TIMx时钟频率预分频值，1000khz计数频率
	TIM_TimeBaseInitStructure.TIM_ClockDivision = 0; //设置时钟分割:TDTS = Tck_tim
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;//TIM向上计数模式
	TIM_TimeBaseInit(TIMx,&TIM_TimeBaseInitStructure);	
	TIM_Cmd(TIMx,ENABLE); //使能或者失能TIMx外设
	/* 设置中断参数，并打开中断 */
	TIM_ITConfig(TIMx, TIM_IT_Update, ENABLE );	//使能或者失能指定的TIM中断
	
	/* 设置NVIC参数 */	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
	NVIC_InitStructure.NVIC_IRQChannel=TIM_IRQn; //打开TIM_IRQn的全局中断
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=0;	//抢占优先级为0
	NVIC_InitStructure.NVIC_IRQChannelSubPriority=1;  //响应优先级为1
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;	//使能
	NVIC_Init(&NVIC_InitStructure);	
}
void TIMER__Config(TIM_TypeDef* TIMx,uint16_t Prescaler,uint16_t Period)
{
	uint32_t RCC_APBPeriph_Source;
	uint8_t TIM_IRQn;
	
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;	 //声明一个结构体变量
	NVIC_InitTypeDef NVIC_InitStructure;

	TIM_ClearITPendingBit(TIMx,TIM_IT_Update);//清除TIMx的中断待处理位:TIM 中断源
	
	if(TIMx==TIM1)      { RCC_APBPeriph_Source=RCC_APB2Periph_TIM1;TIM_IRQn=TIM1_UP_IRQn; }                      
	else if(TIMx==TIM2) { RCC_APBPeriph_Source=RCC_APB1Periph_TIM2;TIM_IRQn=TIM2_IRQn; }
	else if(TIMx==TIM3) { RCC_APBPeriph_Source=RCC_APB1Periph_TIM3;TIM_IRQn=TIM3_IRQn; }
	else if(TIMx==TIM4) { RCC_APBPeriph_Source=RCC_APB1Periph_TIM4;TIM_IRQn=TIM4_IRQn; }
	
	/* 开启定时器时钟 */
	RCC_APB1PeriphClockCmd(RCC_APBPeriph_Source,ENABLE);
  
	TIM_TimeBaseInitStructure.TIM_Period = Period-1;//设置自动重装载寄存器周期的值
	TIM_TimeBaseInitStructure.TIM_Prescaler = Prescaler-1;//设置用来作为TIMx时钟频率预分频值，1000khz计数频率
	TIM_TimeBaseInitStructure.TIM_ClockDivision = 0; //设置时钟分割:TDTS = Tck_tim
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;//TIM向上计数模式
	TIM_TimeBaseInit(TIMx,&TIM_TimeBaseInitStructure);	
	TIM_Cmd(TIMx,ENABLE); //使能或者失能TIMx外设
	/* 设置中断参数，并打开中断 */
	TIM_ITConfig(TIMx, TIM_IT_Update, ENABLE );	//使能或者失能指定的TIM中断
	
	/* 设置NVIC参数 */	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
	NVIC_InitStructure.NVIC_IRQChannel=TIM_IRQn; //打开TIM_IRQn的全局中断
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=0;	//抢占优先级为0
	NVIC_InitStructure.NVIC_IRQChannelSubPriority=1;  //响应优先级为1
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;	//使能
	NVIC_Init(&NVIC_InitStructure);	
}
void TIMER_Reload(TIM_TypeDef* TIMx,uint16_t Period) //设置自动重装载定时值
{
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;	
	TIM_TimeBaseInitStructure.TIM_Period = Period-1;
	TIM_TimeBaseInit(TIMx,&TIM_TimeBaseInitStructure);
}
void TIMER__Reload(TIM_TypeDef* TIMx,uint16_t Prescaler,uint16_t Period) //设置自动重装载定时值
{
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;	
	TIM_TimeBaseInitStructure.TIM_Period = Period-1;
	TIM_TimeBaseInitStructure.TIM_Prescaler = Prescaler-1;
	TIM_TimeBaseInit(TIMx,&TIM_TimeBaseInitStructure);
}
void TIMER_ON(TIM_TypeDef* TIMx)  //打开定时器
{
  TIM_Cmd(TIMx,ENABLE);	
}
void TIMER_OFF(TIM_TypeDef* TIMx) //关闭定时器
{
  TIM_Cmd(TIMx,DISABLE);	
}
#endif










/*************************************************PWM脉宽调制***********************************************************/
#if (USE_PWM == 1)
void PWM_TIM1_Config(uint16_t Prescaler,uint16_t Period,uint16_t Pulse) 
{
	GPIO_InitTypeDef GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_OCInitTypeDef TIM_OCInitStructure;

