Angle145/FSC_STOS/新版：FSC-OS/FSC-OS_V1.0.2_Beta_STM32F10x/User/STM32F10xPeripMode.h
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1,ENABLE); 

	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_8;// |GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_AF_PP; //复用推挽输出
	GPIO_Init(GPIOA,&GPIO_InitStructure);

	TIM_TimeBaseInitStructure.TIM_Period =Period-1 ;//设置自动重装载寄存器周期的值
	TIM_TimeBaseInitStructure.TIM_Prescaler = Prescaler-1;//设置用来作为TIMx时钟频率预分频值
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;//设置时钟分割:TDTS = Tck_tim
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;//TIM向上计数模式
	TIM_TimeBaseInit(TIM1, & TIM_TimeBaseInitStructure);

	TIM_OCInitStructure.TIM_OCMode=TIM_OCMode_PWM1; //模式1
	TIM_OCInitStructure.TIM_OutputState=TIM_OutputState_Enable;//PWM输出使能
	//TIM_OCInitStructure.TIM_OutputNState=TIM_OutputNState_Enable;//PWM输出使能
	//TIM_OCInitStructure.TIM_OutputState=TIM_OutputNState_Disable; //PWM输出失能
	TIM_OCInitStructure.TIM_Pulse=Pulse-1;
	TIM_OCInitStructure.TIM_OCPolarity=TIM_OCPolarity_Low;  //定时器停止工作时IO口的状态为低(TIM_OCPolarity_High为高)
	//TIM_OCInitStructure.TIM_OCNPolarity=TIM_OCPolarity_High;
	//TIM_OCInitStructure.TIM_OCNPolarity=TIM_OCNPolarity_High; //输出反相(Low同相)
	TIM_OCInitStructure.TIM_OCIdleState=TIM_OCIdleState_Set; //空闲时输出高
	TIM_OCInitStructure.TIM_OCNIdleState=TIM_OCNIdleState_Reset;//空闲时输出低  
	TIM_OC1Init(TIM1,&TIM_OCInitStructure);

	TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable);

	//TIM_Cmd(TIM1,ENABLE);//

	//下面这句是高级定时器TIM1和TIM8才有，输出PWM必须打开
	//TIM_CtrlPWMOutputs(TIM1, ENABLE); //pwm输出
}

void PWM_TIM1_OC_Config(uint16_t Prescaler,uint16_t Period,uint16_t Pulse,uint8_t DTime) 
{
	GPIO_InitTypeDef         GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
	TIM_BDTRInitTypeDef      TIM_BDTRInitStructure;	
	TIM_OCInitTypeDef        TIM_OCInitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1,ENABLE); 

	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_8;// |GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_AF_PP; //复用推挽输出
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_13;//|GPIO_Pin_14|GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_AF_PP; //复用推挽输出
	GPIO_Init(GPIOB,&GPIO_InitStructure);

	/* Time base configuration */
	TIM_TimeBaseStructure.TIM_Period = Period-1; //计数周期，向上记到此数，计数值清零
	TIM_TimeBaseStructure.TIM_Prescaler = Prescaler-1;//定时器分频系数，Ftimer = 72M/(TIM_Prescaler+1) 
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;//定时器时钟再分频，供数字滤波器使用（死区发生器也使用此时钟）
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;//向上计数模式
	TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure);
	
  TIM_BDTRInitStructure.TIM_OSSRState = TIM_OSSRState_Disable;//
  TIM_BDTRInitStructure.TIM_OSSIState = TIM_OSSIState_Disable;//
  TIM_BDTRInitStructure.TIM_LOCKLevel = TIM_LOCKLevel_OFF;         //
  TIM_BDTRInitStructure.TIM_DeadTime = DTime;                      //
  TIM_BDTRInitStructure.TIM_Break = TIM_Break_Disable;                 //
  TIM_BDTRInitStructure.TIM_BreakPolarity = TIM_BreakPolarity_High;//
  TIM_BDTRInitStructure.TIM_AutomaticOutput = TIM_AutomaticOutput_Enable;//
  TIM_BDTRConfig(TIM1,&TIM_BDTRInitStructure); 

	 /* PWM1 Mode configuration: Channel1 */
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;//PWM2模式
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable; //比较输出使能
	TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;//比较互补输出使能
	TIM_OCInitStructure.TIM_Pulse = Pulse-1;   //比较值，即占空比
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;  //输出极性
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High;//互补输出极性
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;//指定空闲状态下的TIM输出比较的引脚状态。
	TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset;//指定空闲状态下的TIM互补输出比较的引脚状态。
	TIM_OC1Init(TIM1, &TIM_OCInitStructure);   //初始化通道二比较输出
	TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable);      //配置通道一，自动重装载使能  

	TIM_ARRPreloadConfig(TIM1, ENABLE);//重载装载值 ENABLE 立即生效，DISABLE 下一个比较周期生效

	/* TIM1 enable counter */
	//TIM_Cmd(TIM1, ENABLE);//使能定时器1
	
	//TIM_CtrlPWMOutputs(TIM1, ENABLE);//使能PWM外围输出 
}

void PWM_TIM1_ON(void)
{
  TIM_Cmd(TIM1, ENABLE);//使能定时器1
	TIM_CtrlPWMOutputs(TIM1, ENABLE);//使能PWM外围输出
}
void PWM_TIM1_OFF(void)
{
  TIM_Cmd(TIM1, DISABLE);//失能定时器1
	TIM_CtrlPWMOutputs(TIM1, DISABLE);//使能PWM外围输出
}
void PWM_TIM1_OC_ON(void)
{
  TIM_Cmd(TIM1, ENABLE);//使能定时器1
	TIM_CtrlPWMOutputs(TIM1, ENABLE);//使能PWM外围输出
}
void PWM_TIM1_OC_OFF(void)
{
  TIM_Cmd(TIM1, DISABLE);//失能定时器1
	TIM_CtrlPWMOutputs(TIM1, DISABLE);//使能PWM外围输出
}
#endif














/****************************************************频率计*************************************************************/
//CAPTURE_STA_TIM2CH[]捕获状态位说明
//[7]:0,没有成功捕获；1,成功捕获到一次完整周期
//[6]:0,还没捕获到低电平;1,已经捕获到低电平.
//[5]:0,还没捕获到低电平;1,已经捕获到高电平.
//[4:0]:捕获低电平后溢出第次数（这里未使用，而是直接采用累加求和）
#if (USE_FREQMETER == 1)
uint16_t CAPTURE_STA_TIM2CH[4] = {0};
uint32_t CAPTURE_DOWNVAL_TIM2CH[4];
uint32_t CAPTURE_UPVAL_TIM2CH[4];
uint16_t CAPTURE_CYCLE_TIM2CH[4];
uint16_t CAPTURE_UP_TIM2CH[4]; 
uint16_t CAPTURE_DOWN_TIM2CH[4];
uint8_t  FreqMeter_CH_NUM;
uint16_t FreqMeter_Prescaler;
uint32_t OSTimerValue; 
uint8_t  FreqMeterTimerSW=0;
void FreqMeter_TIM2(uint16_t Prescaler,uint8_t CHNum)
{	
    GPIO_InitTypeDef GPIO_InitStruct;
    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
    TIM_ICInitTypeDef TIM_ICInitStruct;
    NVIC_InitTypeDef NVIC_InitStruct;
	   
	  FreqMeter_Prescaler=Prescaler;
	  FreqMeter_CH_NUM=CHNum;
	
    //开启TIM2和GPIO时钟
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    //GPIO初始化
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IPD;            //下拉输入
	  switch(CHNum) 
		{
		  case 1: GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0; break;
			case 2: GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1; break;
			case 3: GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_2; break;
			case 4: GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_2|GPIO_Pin_3; break;
			default:break;
		}
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStruct);
    
    //TIM2定时器初始化
    TIM_TimeBaseInitStruct.TIM_Period = 0xFFFF -1 ; //设为最大
    TIM_TimeBaseInitStruct.TIM_Prescaler = Prescaler-1;
    TIM_TimeBaseInitStruct.TIM_ClockDivision = TIM_CKD_DIV1;        
    TIM_TimeBaseInitStruct.TIM_CounterMode = TIM_CounterMode_Up;        //向上计数
    TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStruct);
    
    //TIM2_CH1输入捕获初始化
		if(CHNum>0)
		{		
			TIM_ICInitStruct.TIM_Channel = TIM_Channel_1;
			TIM_ICInitStruct.TIM_ICFilter = 0x00;                            //不滤波
			TIM_ICInitStruct.TIM_ICPolarity = TIM_ICPolarity_Rising;        //上升沿捕获
			TIM_ICInitStruct.TIM_ICPrescaler = TIM_ICPSC_DIV1;                //输入器不分频
			TIM_ICInitStruct.TIM_ICSelection = TIM_ICSelection_DirectTI;    //映射到IC1
			TIM_ICInit(TIM2, &TIM_ICInitStruct);
		}
    
