Angle145/FSC_STOS/新版：FSC-OS/FSC-OS_V1.0.2_Beta_STM32F10x/User/STM32F10xPeripMode.h
		if(CHNum>1)
		{
			TIM_ICInitStruct.TIM_Channel = TIM_Channel_2;
			TIM_ICInitStruct.TIM_ICFilter = 0x00;                            //不滤波
			TIM_ICInitStruct.TIM_ICPolarity = TIM_ICPolarity_Rising;        //上升沿捕获
			TIM_ICInitStruct.TIM_ICPrescaler = TIM_ICPSC_DIV1;                //输入器不分频
			TIM_ICInitStruct.TIM_ICSelection = TIM_ICSelection_DirectTI;    //映射到IC2
			TIM_ICInit(TIM2, &TIM_ICInitStruct);
		}
    
		if(CHNum>2)
		{
			TIM_ICInitStruct.TIM_Channel = TIM_Channel_3;
			TIM_ICInitStruct.TIM_ICFilter = 0x00;                            //不滤波
			TIM_ICInitStruct.TIM_ICPolarity = TIM_ICPolarity_Rising;        //上升沿捕获
			TIM_ICInitStruct.TIM_ICPrescaler = TIM_ICPSC_DIV1;                //输入器不分频
			TIM_ICInitStruct.TIM_ICSelection = TIM_ICSelection_DirectTI;    //映射到IC3
			TIM_ICInit(TIM2, &TIM_ICInitStruct);
		}
   
		if(CHNum>3)
		{		
			TIM_ICInitStruct.TIM_Channel = TIM_Channel_4;
			TIM_ICInitStruct.TIM_ICFilter = 0x00;                            //不滤波
			TIM_ICInitStruct.TIM_ICPolarity = TIM_ICPolarity_Rising;        //上升沿捕获
			TIM_ICInitStruct.TIM_ICPrescaler = TIM_ICPSC_DIV1;                //输入器不分频
			TIM_ICInitStruct.TIM_ICSelection = TIM_ICSelection_DirectTI;    //映射到IC4
			TIM_ICInit(TIM2, &TIM_ICInitStruct);
		}
    
    //中断分组初始化
    NVIC_InitStruct.NVIC_IRQChannel = TIM2_IRQn;
    NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
    NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 2;
    NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
    NVIC_Init(&NVIC_InitStruct);    
    
		switch(CHNum) 
		{
		  case 1: TIM_ITConfig(TIM2, TIM_IT_CC1, ENABLE);  break;
			case 2: TIM_ITConfig(TIM2, TIM_IT_CC1|TIM_IT_CC2, ENABLE);  break;
			case 3: TIM_ITConfig(TIM2, TIM_IT_CC1|TIM_IT_CC2|TIM_IT_CC3, ENABLE);  break;
			case 4: TIM_ITConfig(TIM2, TIM_IT_CC1|TIM_IT_CC2|TIM_IT_CC3|TIM_IT_CC4, ENABLE);  break;
			default:break;
		}
    //TIM_ITConfig(TIM2, TIM_IT_CC1|TIM_IT_CC2|TIM_IT_CC3|TIM_IT_CC4, ENABLE);            //更新中断和CC1IE捕获中断
    
    //TIM_Cmd(TIM2, ENABLE);
		#if (USE_FREQMETER_PRINTF==1 ) 
    printf("Init FreqMeter_TIM2 Success ! \r\n"); 
		#endif
}
void FreqMeter_ON(void)
{
  TIM_Cmd(TIM2, ENABLE);//使能定时器
}
void FreqMeter_OFF(void)
{
  TIM_Cmd(TIM2, DISABLE);//失能定时器
}
void FreqMeterTIM2_IRQHandler(void) 
{     
		if(FreqMeter_CH_NUM>0)
		{	
			if((CAPTURE_STA_TIM2CH[0]&0x80) == 0) {                    //还未捕获成功
					if(TIM_GetITStatus(TIM2, TIM_IT_CC1) != RESET) {    //捕获1发生捕获事件
							if(CAPTURE_STA_TIM2CH[0]&0x40) {                    //捕获到一个上升沿
									CAPTURE_STA_TIM2CH[0] |= 0x80;                    //标记成功捕获到一次完整周期
									CAPTURE_CYCLE_TIM2CH[0] = TIM_GetCapture1(TIM2);
									if(CAPTURE_CYCLE_TIM2CH[0] >= CAPTURE_DOWN_TIM2CH[0]) 
											CAPTURE_DOWNVAL_TIM2CH[0] = CAPTURE_CYCLE_TIM2CH[0] - CAPTURE_DOWN_TIM2CH[0];
									else 
											CAPTURE_DOWNVAL_TIM2CH[0] = 0xffff + CAPTURE_CYCLE_TIM2CH[0] - CAPTURE_DOWN_TIM2CH[0];
									TIM_OC1PolarityConfig(TIM2, TIM_ICPolarity_Rising);    //CC1P=0 设置为上升沿捕获 //重新开始捕获周期脉冲
								}									
							else if(CAPTURE_STA_TIM2CH[0]&0x20) {                    //捕获到一个下降沿
									CAPTURE_STA_TIM2CH[0] |= 0x40;                    //标记成功捕获到一次高电平脉宽
									CAPTURE_DOWN_TIM2CH[0] = TIM_GetCapture1(TIM2);
									if(CAPTURE_DOWN_TIM2CH[0] >= CAPTURE_UP_TIM2CH[0]) 
											CAPTURE_UPVAL_TIM2CH[0] = CAPTURE_DOWN_TIM2CH[0] - CAPTURE_UP_TIM2CH[0];
									else 
											CAPTURE_UPVAL_TIM2CH[0] = 0xffff + CAPTURE_DOWN_TIM2CH[0] - CAPTURE_UP_TIM2CH[0];
									TIM_OC1PolarityConfig(TIM2, TIM_ICPolarity_Rising);    //CC1P=0 设置为上升沿捕获
							} else {                                        //还未开始，第一次捕获上升沿
									CAPTURE_STA_TIM2CH[0] = 0;                    //清空
								  CAPTURE_DOWNVAL_TIM2CH[0]=0;
									CAPTURE_UPVAL_TIM2CH[0] = 0;
									CAPTURE_UP_TIM2CH[0] = TIM_GetCapture1(TIM2);
									CAPTURE_STA_TIM2CH[0] |= 0x20;                //标记捕获到了上升沿
									TIM_OC1PolarityConfig(TIM2, TIM_ICPolarity_Falling);    //CC1P=1 设置为下降沿捕获
							}    
							TIM_ClearFlag(TIM2, TIM_FLAG_CC1);                                //清除状态标志
					}
			} 
		}

		if(FreqMeter_CH_NUM>1)
		{
      if((CAPTURE_STA_TIM2CH[1]&0x80) == 0) {                    //还未捕获成功
        if(TIM_GetITStatus(TIM2, TIM_IT_CC2) != RESET) {            //捕获2发生捕获事件
							if(CAPTURE_STA_TIM2CH[1]&0x40) {                    //捕获到一个上升沿
									CAPTURE_STA_TIM2CH[1] |= 0x80;                    //标记成功捕获到一次完整周期
									CAPTURE_CYCLE_TIM2CH[1] = TIM_GetCapture2(TIM2);
									if(CAPTURE_CYCLE_TIM2CH[1] >= CAPTURE_DOWN_TIM2CH[1]) 
											CAPTURE_DOWNVAL_TIM2CH[1] = CAPTURE_CYCLE_TIM2CH[1] - CAPTURE_DOWN_TIM2CH[1];
									else 
											CAPTURE_DOWNVAL_TIM2CH[1] = 0xffff + CAPTURE_CYCLE_TIM2CH[1] - CAPTURE_DOWN_TIM2CH[1];
									TIM_OC1PolarityConfig(TIM2, TIM_ICPolarity_Rising);    //CC1P=0 设置为上升沿捕获 //重新开始捕获周期脉冲
								}
            else if(CAPTURE_STA_TIM2CH[1]&0x20) {                        //捕获到一个下降沿
                CAPTURE_STA_TIM2CH[1] |= 0x40;                        //标记成功捕获到一次高电平脉宽
                CAPTURE_DOWN_TIM2CH[1] = TIM_GetCapture2(TIM2);        //获取捕获2计数
                if(CAPTURE_DOWN_TIM2CH[1] >= CAPTURE_UP_TIM2CH[1])
                    CAPTURE_UPVAL_TIM2CH[1] = CAPTURE_DOWN_TIM2CH[1] - CAPTURE_UP_TIM2CH[1];
                else
                    CAPTURE_UPVAL_TIM2CH[1] = 0xffff + CAPTURE_DOWN_TIM2CH[1] - CAPTURE_UP_TIM2CH[1];
                TIM_OC2PolarityConfig(TIM2, TIM_ICPolarity_Rising);    //CC1P=0 设置为上升沿捕获
            } else {                                                //还未开始，第一次捕获上升沿
                CAPTURE_STA_TIM2CH[1] = 0;                            //清空
							  CAPTURE_DOWNVAL_TIM2CH[1]=0;
                CAPTURE_UPVAL_TIM2CH[1] = 0;
                CAPTURE_UP_TIM2CH[1] = TIM_GetCapture2(TIM2);
                CAPTURE_STA_TIM2CH[1] |= 0x20;                //标记捕获到了上升沿
                TIM_OC2PolarityConfig(TIM2, TIM_ICPolarity_Falling);    //CC1P=1 设置为下降沿捕获
            }
            TIM_ClearFlag(TIM2, TIM_FLAG_CC2);                                //清除状态标志    
        }
      } 
		}
    
