Angle145/FSC_STOS/新版：FSC-OS/FSC-OS_V1.0.2_Beta_STM32F10x/User/STM32F10xPeripMode.h
		if(FreqMeter_CH_NUM>2)
		{
			if((CAPTURE_STA_TIM2CH[2]&0x80) == 0) {                    //还未捕获成功
					if(TIM_GetITStatus(TIM2, TIM_IT_CC3) != RESET) {    //捕获1发生捕获事件
							if(CAPTURE_STA_TIM2CH[2]&0x40) {                    //捕获到一个下降沿
									CAPTURE_STA_TIM2CH[2] |= 0x80;                    //标记成功捕获到一次高电平脉宽
									CAPTURE_CYCLE_TIM2CH[2] = TIM_GetCapture3(TIM2);
									if(CAPTURE_CYCLE_TIM2CH[2] >= CAPTURE_DOWN_TIM2CH[2]) 
											CAPTURE_DOWNVAL_TIM2CH[2] = CAPTURE_CYCLE_TIM2CH[2] - CAPTURE_DOWN_TIM2CH[2];
									else 
											CAPTURE_DOWNVAL_TIM2CH[2] = 0xffff + CAPTURE_CYCLE_TIM2CH[2] - CAPTURE_DOWN_TIM2CH[2];
									TIM_OC3PolarityConfig(TIM2, TIM_ICPolarity_Rising);    //CC1P=0 设置为上升沿捕获 //重新开始捕获周期脉冲
								}									
							else if(CAPTURE_STA_TIM2CH[2]&0x20) {                    //捕获到一个下降沿
									CAPTURE_STA_TIM2CH[2] |= 0x40;                    //标记成功捕获到一次高电平脉宽
									CAPTURE_DOWN_TIM2CH[2] = TIM_GetCapture3(TIM2);
									if(CAPTURE_DOWN_TIM2CH[2] >= CAPTURE_UP_TIM2CH[2]) 
											CAPTURE_UPVAL_TIM2CH[2] = CAPTURE_DOWN_TIM2CH[2] - CAPTURE_UP_TIM2CH[2];
									else 
											CAPTURE_UPVAL_TIM2CH[2] = 0xffff + CAPTURE_DOWN_TIM2CH[2] - CAPTURE_UP_TIM2CH[2];
									TIM_OC3PolarityConfig(TIM2, TIM_ICPolarity_Rising);    //CC1P=0 设置为上升沿捕获
							} else {                                        //还未开始，第一次捕获上升沿
									CAPTURE_STA_TIM2CH[2] = 0;                    //清空
								  CAPTURE_DOWNVAL_TIM2CH[2]=0;
									CAPTURE_UPVAL_TIM2CH[2] = 0;
									CAPTURE_UP_TIM2CH[2] = TIM_GetCapture3(TIM2);
									CAPTURE_STA_TIM2CH[2] |= 0x20;                //标记捕获到了上升沿
									TIM_OC3PolarityConfig(TIM2, TIM_ICPolarity_Falling);    //CC1P=1 设置为下降沿捕获
							}    
							TIM_ClearFlag(TIM2, TIM_FLAG_CC3);                                //清除状态标志
					}
			} 
		}
		
		if(FreqMeter_CH_NUM>3)
		{
			if((CAPTURE_STA_TIM2CH[3]&0x80) == 0) {                    //还未捕获成功
					if(TIM_GetITStatus(TIM2, TIM_IT_CC4) != RESET) {    //捕获1发生捕获事件
							if(CAPTURE_STA_TIM2CH[3]&0x40) {                    //捕获到一个下降沿
									CAPTURE_STA_TIM2CH[3] |= 0x80;                    //标记成功捕获到一次高电平脉宽
									CAPTURE_CYCLE_TIM2CH[3] = TIM_GetCapture4(TIM2);
									if(CAPTURE_CYCLE_TIM2CH[3] >= CAPTURE_DOWN_TIM2CH[3]) 
											CAPTURE_DOWNVAL_TIM2CH[3] = CAPTURE_CYCLE_TIM2CH[3] - CAPTURE_DOWN_TIM2CH[3];
									else 
											CAPTURE_DOWNVAL_TIM2CH[3] = 0xffff + CAPTURE_CYCLE_TIM2CH[3] - CAPTURE_DOWN_TIM2CH[3];
									TIM_OC4PolarityConfig(TIM2, TIM_ICPolarity_Rising);    //CC1P=0 设置为上升沿捕获 //重新开始捕获周期脉冲
								}									
							else if(CAPTURE_STA_TIM2CH[3]&0x20) {                    //捕获到一个下降沿
									CAPTURE_STA_TIM2CH[3] |= 0x40;                    //标记成功捕获到一次高电平脉宽
									CAPTURE_DOWN_TIM2CH[3] = TIM_GetCapture4(TIM2);
									if(CAPTURE_DOWN_TIM2CH[3] >= CAPTURE_UP_TIM2CH[3]) 
											CAPTURE_UPVAL_TIM2CH[3] = CAPTURE_DOWN_TIM2CH[3] - CAPTURE_UP_TIM2CH[3];
									else 
											CAPTURE_UPVAL_TIM2CH[3] = 0xffff + CAPTURE_DOWN_TIM2CH[3] - CAPTURE_UP_TIM2CH[3];
									TIM_OC4PolarityConfig(TIM2, TIM_ICPolarity_Rising);    //CC1P=0 设置为上升沿捕获
							} else {                                        //还未开始，第一次捕获上升沿
									CAPTURE_STA_TIM2CH[3] = 0;                    //清空
								  CAPTURE_DOWNVAL_TIM2CH[3]=0;
									CAPTURE_UPVAL_TIM2CH[3] = 0;
									CAPTURE_UP_TIM2CH[3] = TIM_GetCapture4(TIM2);
									CAPTURE_STA_TIM2CH[3] |= 0x20;                //标记捕获到了上升沿
									TIM_OC4PolarityConfig(TIM2, TIM_ICPolarity_Falling);    //CC1P=1 设置为下降沿捕获
							}    
							TIM_ClearFlag(TIM2, TIM_FLAG_CC4);                                //清除状态标志
					}
			} 
		}
  
    //处理帧数据
		if((FreqMeterTimerSW&0x80)==0)
		{
			FreqMeterTimerSW|=0x80;
			if(GetOSSliceTime()+ FREQMETER_PRINTF_TIME< 0xFFFFFFFF) OSTimerValue=GetOSSliceTime(); 
			else  OSTimerValue=FREQMETER_PRINTF_TIME+GetOSSliceTime()-0xFFFFFFFF;
		}
		if(FreqMeter_CH_NUM>0)  
		{	
			if(CAPTURE_STA_TIM2CH[0]&0x80) {                                //成功捕获到了一次周期        
				  FreqMeter.FreqCh[0] = SystemCoreClock/FreqMeter_Prescaler/(CAPTURE_UPVAL_TIM2CH[0]+CAPTURE_DOWNVAL_TIM2CH[0]);           //溢出时间总和,得到总的周期时间
					FreqMeter.DutyCh[0] = 100*CAPTURE_UPVAL_TIM2CH[0]/(CAPTURE_UPVAL_TIM2CH[0]+CAPTURE_DOWNVAL_TIM2CH[0]);                  
					#if (USE_FREQMETER_PRINTF==1 )
					if(GetOSSliceTime()>OSTimerValue+FREQMETER_PRINTF_TIME)
					{
						FreqMeterTimerSW&=0x7F;
						FreqMeterTimerSW|=0x01;
						printf("FreqMeter CH1 FREQ:%d\t   \r\n", FreqMeter.FreqCh[0]);	
						printf("FreqMeter CH1 DUTY:%d\t   \r\n", FreqMeter.DutyCh[0]);	
					}						
					#endif
					CAPTURE_STA_TIM2CH[0] = 0;
			} 
		}
		if(FreqMeter_CH_NUM>1)
		{
			if(CAPTURE_STA_TIM2CH[1]&0x80) {                                //成功捕获到了一次周期     
				  FreqMeter.FreqCh[1] = SystemCoreClock/FreqMeter_Prescaler/(CAPTURE_UPVAL_TIM2CH[1]+CAPTURE_DOWNVAL_TIM2CH[1]);           //溢出时间总和,得到总的周期时间
					FreqMeter.DutyCh[1] = 100*CAPTURE_UPVAL_TIM2CH[1]/(CAPTURE_UPVAL_TIM2CH[1]+CAPTURE_DOWNVAL_TIM2CH[1]);                           
					#if (USE_FREQMETER_PRINTF==1 ) 
					if(GetOSSliceTime()>OSTimerValue+FREQMETER_PRINTF_TIME)
					{
						FreqMeterTimerSW&=0x7F;
						FreqMeterTimerSW|=0x02;
						printf("FreqMeter CH2 FREQ:%d\t  \r\n", FreqMeter.FreqCh[1]);	
						printf("FreqMeter CH2 DUTY:%d\t  \r\n", FreqMeter.DutyCh[1]);
					}
					#endif
					CAPTURE_STA_TIM2CH[1] = 0;
			} 
		}
		if(FreqMeter_CH_NUM>2)
		{
			if(CAPTURE_STA_TIM2CH[2]&0x80) {                                //成功捕获到了一次周期       
				  FreqMeter.FreqCh[2] = SystemCoreClock/FreqMeter_Prescaler/(CAPTURE_UPVAL_TIM2CH[2]+CAPTURE_DOWNVAL_TIM2CH[2]);           //溢出时间总和,得到总的周期时间
					FreqMeter.DutyCh[2] = 100*CAPTURE_UPVAL_TIM2CH[2]/(CAPTURE_UPVAL_TIM2CH[2]+CAPTURE_DOWNVAL_TIM2CH[2]);                            
					#if (USE_FREQMETER_PRINTF==1 ) 
					if(GetOSSliceTime()>OSTimerValue+FREQMETER_PRINTF_TIME)	
					{
						FreqMeterTimerSW&=0x7F;
						FreqMeterTimerSW|=0x04;
						printf("FreqMeter CH3 FREQ:%d\t  \r\n", FreqMeter.FreqCh[2]);	
						printf("FreqMeter CH3 DUTY:%d\t  \r\n", FreqMeter.DutyCh[2]);
					}
					#endif
					CAPTURE_STA_TIM2CH[2] = 0;
			} 
		}
		if(FreqMeter_CH_NUM>3)
		{
			if(CAPTURE_STA_TIM2CH[3]&0x80) {                                //成功捕获到了一次周期         
				  FreqMeter.FreqCh[3] = SystemCoreClock/FreqMeter_Prescaler/(CAPTURE_UPVAL_TIM2CH[3]+CAPTURE_DOWNVAL_TIM2CH[3]);           //溢出时间总和,得到总的周期时间
					FreqMeter.DutyCh[3] = 100*CAPTURE_UPVAL_TIM2CH[3]/(CAPTURE_UPVAL_TIM2CH[3]+CAPTURE_DOWNVAL_TIM2CH[3]);                           
					#if (USE_FREQMETER_PRINTF==1 ) 
					if(GetOSSliceTime()>OSTimerValue+FREQMETER_PRINTF_TIME)
					{
						FreqMeterTimerSW&=0x7F;
						FreqMeterTimerSW|=0x08;
						printf("FreqMeter CH4 FREQ:%d\t  \r\n", FreqMeter.FreqCh[3]);	
						printf("FreqMeter CH4 DUTY:%d\t  \r\n", FreqMeter.DutyCh[3]);
					}
					#endif
					CAPTURE_STA_TIM2CH[3] = 0;
			}
		}
		if(FreqMeterTimerSW&0x0F) FreqMeterTimerSW=0;
		TIM_ClearITPendingBit(TIM2, TIM_IT_CC1|TIM_IT_Update); //清除中断标志位
	}
#endif
	
	
	
	
	
	
	
	
	
	
	
	
	
	
/**************************************************串口模块******************************************************/	
#if (USE_USART == 1)
#pragma import(__use_no_semihosting)                             
struct __FILE 
{ 
	int handle; 
}; 
FILE __stdout;    
void _sys_exit(int x) 
{ 
	x = x; 
}
#if (printf_use_usartx == 1)
USART_TypeDef *PRINTF_USARTx = USART1; 
#endif
#if (printf_use_usartx == 2)
USART_TypeDef *PRINTF_USARTx = USART2; 
#endif
#if (printf_use_usartx == 3)
USART_TypeDef *PRINTF_USARTx = USART3; 
#endif
int fputc(int ch, FILE *f)
{	         
	USART_SendData(PRINTF_USARTx, (uint8_t) ch);
	while (USART_GetFlagStatus(PRINTF_USARTx, USART_FLAG_TC) != SET);
	return ch;	
} 

/********************************串口接收检测***************************************/
void STM32F10xPeripMode_Usart1RxCheck(void)
{
	if(USART_GetFlagStatus(USART1, USART_FLAG_PE) != RESET)     
  {        
	  USART_ReceiveData(USART1);    
    USART_ClearFlag(USART1, USART_FLAG_PE);  
  } 
   if(USART_GetFlagStatus(USART1, USART_FLAG_ORE) != RESET)  
  {
     USART_ReceiveData(USART1);   
     USART_ClearFlag(USART1, USART_FLAG_ORE); 
  }     
   if(USART_GetFlagStatus(USART1, USART_FLAG_FE) != RESET)
  {      
	  USART_ReceiveData(USART1);  
	  USART_ClearFlag(USART1, USART_FLAG_FE);   
	} 
}
void STM32F10xPeripMode_Usart2RxCheck(void)
{
	if(USART_GetFlagStatus(USART2, USART_FLAG_PE) != RESET)     
  {        
	  USART_ReceiveData(USART2);    
    USART_ClearFlag(USART2, USART_FLAG_PE);  
  } 
   if(USART_GetFlagStatus(USART2, USART_FLAG_ORE) != RESET)  
  {
     USART_ReceiveData(USART2);   
     USART_ClearFlag(USART2, USART_FLAG_ORE); 
  }     
   if(USART_GetFlagStatus(USART2, USART_FLAG_FE) != RESET)
  {      
	  USART_ReceiveData(USART2);  
	  USART_ClearFlag(USART2, USART_FLAG_FE);   
	}
}
void STM32F10xPeripMode_Usart3RxCheck(void)
{
	if(USART_GetFlagStatus(USART3, USART_FLAG_PE) != RESET)     
  {        
	  USART_ReceiveData(USART3);    
    USART_ClearFlag(USART3, USART_FLAG_PE);  
  } 
   if(USART_GetFlagStatus(USART3, USART_FLAG_ORE) != RESET)  
  {
     USART_ReceiveData(USART3);   
     USART_ClearFlag(USART3, USART_FLAG_ORE); 
  }     
   if(USART_GetFlagStatus(USART3, USART_FLAG_FE) != RESET)
  {      
	  USART_ReceiveData(USART3);  
	  USART_ClearFlag(USART3, USART_FLAG_FE);   
	}
}
/**********************************************************************************/

