Angle145/FSC_STOS/新版：FSC-OS/FSC-OS_V1.0.2_Beta_STM32F10x/User/STM32F10xPeripMode.h
/**********************************串口接收据据************************************/
void STM32F10xPeripMode_Usart1_UsartReceiveByte(uint8_t UsartRxByte)
{
	if(Usart1.ByteCnt<USART_RX_BUFF_LEN-1) Usart1.RX_BUFF[Usart1.ByteCnt++]=UsartRxByte;
	else { Usart1.ByteCnt=0; Usart1.RX_BUFF[Usart1.ByteCnt]=UsartRxByte;}
}
void STM32F10xPeripMode_Usart2_UsartReceiveByte(uint8_t UsartRxByte)
{
	if(Usart2.ByteCnt<USART_RX_BUFF_LEN-1) Usart2.RX_BUFF[Usart2.ByteCnt++]=UsartRxByte;
	else { Usart2.ByteCnt=0; Usart2.RX_BUFF[Usart2.ByteCnt]=UsartRxByte;}
}
void STM32F10xPeripMode_Usart3_UsartReceiveByte(uint8_t UsartRxByte)
{
	if(Usart3.ByteCnt<USART_RX_BUFF_LEN-1) Usart3.RX_BUFF[Usart3.ByteCnt++]=UsartRxByte;
	else { Usart3.ByteCnt=0; Usart3.RX_BUFF[Usart3.ByteCnt]=UsartRxByte;}
}
/**********************************************************************************/
/************************************************************************
*串口1引脚: PA9  --  TXD
            PA10 --  RXD
*停止位：1  
*数据位：8
*奇偶校验：无
************************************************************************/
void USART1_Config(u32 baudRate) //串口1初使化  使用printf函数进行发送数据 （用户可调用）
{
	GPIO_InitTypeDef GPIO_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;	
	USART_InitTypeDef USART_InitStructure;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_USART1|RCC_APB2Periph_AFIO,ENABLE);

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;               
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;                     
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;          
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;                    
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1); 
	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn; 
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0; 
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1; 
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; 
	NVIC_Init(&NVIC_InitStructure);

  USART_InitStructure.USART_BaudRate = baudRate;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;//USART_WordLength_8b：8位数据，USART_WordLength_9b：9位数据
	USART_InitStructure.USART_StopBits = USART_StopBits_1;//USART_StopBits_0_5：0.5个停止位，USART_StopBits_1：1个，USART_StopBits_1_5：1.5个，USART_StopBits_2：2个
	USART_InitStructure.USART_Parity = USART_Parity_No;  //USART_Parity_No：无奇偶校验，USART_Parity_Even：偶校验，USART_Parity_Odd：奇校验
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx; //收发模式，此处收发均使能
	USART_Init(USART1, &USART_InitStructure);
	
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE); 	//开启接收中断
	//USART_ITConfig(USART1, USART_IT_TXE, ENABLE);	//开启发送中断
	USART_Cmd(USART1, ENABLE);
	USART_ClearFlag(USART1,USART_FLAG_TC);
}

void USART2_Config(u32 baudRate)   //(用户可调用)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;	
	USART_InitTypeDef USART_InitStructure;
 
	//注：USART2用的是APB1的时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_AFIO,ENABLE);
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;               
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;                     
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;          
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;                    
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1); 
	NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn; 
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0; 
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2; 
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; 
	NVIC_Init(&NVIC_InitStructure);

  USART_InitStructure.USART_BaudRate = baudRate;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;//USART_WordLength_8b：8位数据，USART_WordLength_9b：9位数据
	USART_InitStructure.USART_StopBits = USART_StopBits_1;//USART_StopBits_0_5：0.5个，USART_StopBits_1：1个停止位，USART_StopBits_1_5：1.5个，USART_StopBits_2：2个
	USART_InitStructure.USART_Parity = USART_Parity_No;  //USART_Parity_No：无奇偶校验，USART_Parity_Even：偶校验，USART_Parity_Odd：奇校验
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx; //收发模式，此处收发均使能
	USART_Init(USART2, &USART_InitStructure); 
 
	USART_ITConfig(USART2, USART_IT_RXNE, ENABLE); 	//开启接收中断
	//USART_ITConfig(USART2, USART_IT_TXE, ENABLE);	//开启发送中断
	USART_Cmd(USART2, ENABLE);
	USART_ClearFlag(USART2,USART_FLAG_TC);
}

void USART3_Config(u32 baudRate)   //(用户可调用) //PB10(TX) PB11(RX)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;	
	USART_InitTypeDef USART_InitStructure;
 
	//注：USART3用的是APB1的时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB|RCC_APB2Periph_AFIO,ENABLE);
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;               
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;                     
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;          
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;                    
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1); 
	NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn; 
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0; 
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2; 
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; 
	NVIC_Init(&NVIC_InitStructure);

  USART_InitStructure.USART_BaudRate = baudRate;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;//USART_WordLength_8b：8位数据，USART_WordLength_9b：9位数据
	USART_InitStructure.USART_StopBits = USART_StopBits_1;//USART_StopBits_0_5：0.5个，USART_StopBits_1：1个停止位，USART_StopBits_1_5：1.5个，USART_StopBits_2：2个
	USART_InitStructure.USART_Parity = USART_Parity_No;  //USART_Parity_No：无奇偶校验，USART_Parity_Even：偶校验，USART_Parity_Odd：奇校验
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx; //收发模式，此处收发均使能
	USART_Init(USART3, &USART_InitStructure); 
 
