Angle145/FSC_STOS/新版：FSC-OS/FSC-OS_V1.0.2_Beta_STM32F10x/User/STM32F10xPeripMode.h
	USART_ITConfig(USART3, USART_IT_RXNE, ENABLE); 	//开启接收中断
	//USART_ITConfig(USART3, USART_IT_TXE, ENABLE);	//开启发送中断
	USART_Cmd(USART3, ENABLE);
	USART_ClearFlag(USART3,USART_FLAG_TC);
}

void USART1_SendByte(uint8_t onebyte)
{
  USART_SendData(USART1,onebyte);//通过外设USARTx发送单个数据                    
	while(USART_GetFlagStatus(USART1,USART_FLAG_TXE)==Bit_RESET);
}
void USART1_SendStr(uint8_t *str)
{
	uint16_t i;
	for(i=0;i<65535;i++)
	{
		if(*str=='\0') break; //发送时，遇到'\0'字符则结束发送
		USART_SendData(USART1,*str);//通过外设USARTx发送单个数据                    
		while(USART_GetFlagStatus(USART1,USART_FLAG_TXE)==Bit_RESET);
		str++;
	}
}
void USART1_Send(uint8_t *p,uint16_t len)
{
	uint16_t i;
	for(i=0;i<len;i++)
	{
		USART_SendData(USART1,*p++);//通过外设USARTx发送单个数据                    
		while(USART_GetFlagStatus(USART1,USART_FLAG_TXE)==Bit_RESET);
	}
}
uint8_t USART1_ReadByte(void)
{
  return (USART_ReceiveData(USART1));
}
uint8_t* USART1_Read(uint16_t len)//串口1读取接收的多个字节
{
  uint16_t i;
	uint8_t xbuff[len+1];
	uint8_t* pf=xbuff;
	for(i=0;i<len;i++)
	{
		xbuff[i]=Usart1.RX_BUFF[i];
	}
	xbuff[len]='\0';
	return pf;
}
char* USART1_ReadStr(void)//串口1读取接收的字符串
{
  uint16_t i,j;
	for(i=0;i<USART_RX_BUFF_LEN;i++)
	{
		if(Usart1.RX_BUFF[i]=='\0') break;
	}
	char xbuff[i+1];
	char* pf=xbuff;
	for(j=0;j<i+1;j++)
	{
		xbuff[j]=Usart1.RX_BUFF[j];
	}		
	return pf;
}
	
void USART2_SendByte(uint8_t onebyte)
{                   
	while(USART_GetFlagStatus(USART2,USART_FLAG_TXE)==Bit_RESET);
}
void USART2_SendStr(uint8_t *str)
{
	uint16_t i;
	for(i=0;i<65535;i++)
	{
		if(*str!='\0') //发送时，遇到'\0'字符则结束发送
		{
			USART_SendData(USART2,*str);//通过外设USARTx发送单个数据                    
			while(USART_GetFlagStatus(USART2,USART_FLAG_TXE)==Bit_RESET);
			str++;
		}
		else break;
	}
}
uint8_t USART2_ReadByte(void)
{
   return (USART_ReceiveData(USART2));
}
void USART2_Send(uint8_t *p,uint16_t len)
{
	uint16_t i;
	for(i=0;i<len;i++)
	{
		USART_SendData(USART2,*p++);//通过外设USARTx发送单个数据                    
		while(USART_GetFlagStatus(USART2,USART_FLAG_TXE)==Bit_RESET);
	}
}
uint8_t* USART2_Read(uint16_t len)//串口2读取接收的多个字节
{
  uint16_t i;
	uint8_t xbuff[len+1];
	uint8_t* pf=xbuff;
	for(i=0;i<len;i++)
	{
		xbuff[i]=Usart2.RX_BUFF[i];
	}
	xbuff[len]='\0';
	return pf;
}
char* USART2_ReadStr(void)//串口2读取接收的字符串
{
  uint16_t i,j;
	for(i=0;i<USART_RX_BUFF_LEN;i++)
	{
		if(Usart2.RX_BUFF[i]=='\0') break;
	}
	char xbuff[i+1];
	char* pf=xbuff;
	for(j=0;j<i+1;j++)
	{
		xbuff[j]=Usart2.RX_BUFF[j];
	}		
	return pf;
}
void USART3_SendByte(uint8_t onebyte)
{
  USART_SendData(USART3,onebyte);//通过外设USARTx发送单个数据                    
	while(USART_GetFlagStatus(USART3,USART_FLAG_TXE)==Bit_RESET);
}
void USART3_SendStr(uint8_t *str)
{
	uint16_t i;
	for(i=0;i<65535;i++)
	{
		if(*str!='\0') //发送时，遇到'\0'字符则结束发送
		{
			USART_SendData(USART3,*str);//通过外设USARTx发送单个数据                    
			while(USART_GetFlagStatus(USART3,USART_FLAG_TXE)==Bit_RESET);
			str++;
		}
		else break;
	}
}
uint8_t USART3_ReadByte(void)
{
   return (USART_ReceiveData(USART3));
}
void USART3_Send(uint8_t *p,uint16_t len)
{
	uint16_t i;
	for(i=0;i<len;i++)
	{
		USART_SendData(USART3,*p++);//通过外设USARTx发送单个数据                    
		while(USART_GetFlagStatus(USART3,USART_FLAG_TXE)==Bit_RESET);
	}
}
uint8_t* USART3_Read(uint16_t len)//串口3读取接收的多个字节
{
  uint16_t i;
	uint8_t xbuff[len+1];
	uint8_t* pf=xbuff;
	for(i=0;i<len;i++)
	{
		xbuff[i]=Usart3.RX_BUFF[i];
	}
	xbuff[len]='\0';
	return pf;
}
char* USART3_ReadStr(void)//串口3读取接收的字符串
{
  uint16_t i,j;
	for(i=0;i<USART_RX_BUFF_LEN;i++)
	{
		if(Usart3.RX_BUFF[i]=='\0') break;
	}
	char xbuff[i+1];
	char* pf=xbuff;
	for(j=0;j<i+1;j++)
	{
		xbuff[j]=Usart3.RX_BUFF[j];
	}		
	return pf;
}

#endif















/*************************************************ModBusRTU主站***********************************************************/
#if (USE_MODEBUS == 1)
#define RS485_RX_EN  RS485_EN=0   //RS485接收使能   
#define RS485_TX_EN  RS485_EN=1   //RS485发送使能 


void STM32F10xPeripMode_ModeBusRTU_UsartReceiveByte(uint8_t UsartRxByte)
{
  if(RS485.ByteCnt<RS485_BUFF_LEN-1) RS485.RX_BUFF[RS485.ByteCnt++]=UsartRxByte;
  else { RS485.ByteCnt=0; RS485.RX_BUFF[RS485.ByteCnt]=UsartRxByte; }
}


void ModBusRTU_Config(void)
{
  RS485.ByteCnt=0;  //清空RS485接收缓存
	RS485_TX_EN;      //RS485设置为发送模式
}
void RS485_Send(uint8_t *p,uint16_t num)
{
	RS485_TX_EN;
	if(RS485_USARTTx==1) USART1_Send(p,num); //使用串口1发送 
	else if(RS485_USARTTx==2)USART2_Send(p,num); //使用串口2发送
	else if(RS485_USARTTx==3)USART3_Send(p,num); //使用串口3发送
	RS485_RX_EN;
}
uint16_t CRC16_ByteCheck(uint16_t crc16)
{
	uint8_t i;

	for(i=0;i<8;i++)
	{
		if(crc16&0x0001) { crc16>>=1; crc16^=0xA001; } //先判断再移位
		else crc16>>=1;			
	}
	return crc16;
}
uint16_t CRC16_NBYTE(uint8_t *p,uint8_t num)
{
	uint8_t i;
	uint16_t CRC16=0xFFFF;
	for(i=0;i<num;i++)
	{
		CRC16^=p[i];    
		CRC16=CRC16_ByteCheck(CRC16);
	}
	CRC16=((CRC16&0x00FF)<<8)|((CRC16&0xFF00)>>8);//CRC高低字节互换
	return CRC16;
}
void ModBusRTU_Send(modbusRTU modbus)
{
	uint16_t i;
	uint16_t CRC16;
	
	ModBusRTU_TX=modbus;
	if((ModBusRTU_TX.Function==15)||(ModBusRTU_TX.Function==16))
	{
	  /*********************CRC计算****************************/	
		CRC16=0xFFFF;   //初使化为0xFFFF(必须是0xFFFF)
		CRC16^=ModBusRTU_TX.SlaveID;    //校验从机ID码
		CRC16=CRC16_ByteCheck(CRC16);
		CRC16^=ModBusRTU_TX.Function;     //校验功能码
		CRC16=CRC16_ByteCheck(CRC16);
		CRC16^=ModBusRTU_TX.Address>>8;     //校验高8位数据地址码
		CRC16=CRC16_ByteCheck(CRC16);
		CRC16^=ModBusRTU_TX.Address&0x00FF;     //校验低8位数据地址码
		CRC16=CRC16_ByteCheck(CRC16);
		CRC16^=ModBusRTU_TX.RegNum>>8;     //校验高8位读取寄存器数量
		CRC16=CRC16_ByteCheck(CRC16);
		CRC16^=ModBusRTU_TX.RegNum&0x00FF;     //校验低8位读取寄存器数量
		CRC16=CRC16_ByteCheck(CRC16);
		CRC16^=ModBusRTU_TX.ByteNum;       //校验8位数据字节数
		CRC16=CRC16_ByteCheck(CRC16);
		for(i=0;i<ModBusRTU_TX.ByteNum;i++)
		{
			CRC16^=ModBusRTU_TX.BUFF[i];       //校验8位 ByteNum个数据
		  CRC16=CRC16_ByteCheck(CRC16);
		}		
		CRC16=((CRC16&0x00FF)<<8)|((CRC16&0xFF00)>>8);   //CRC高低字节互换
    /******************************************/
		RS485.TX_BUFF[0]=ModBusRTU_TX.SlaveID;    //发送设备ID码
		RS485.TX_BUFF[1]=ModBusRTU_TX.Function;    //发送功能码
		RS485.TX_BUFF[2]=ModBusRTU_TX.Address>>8;   //发送高8位数据地址码
		RS485.TX_BUFF[3]=ModBusRTU_TX.Address;      //发送低8位数据地址码
		RS485.TX_BUFF[4]=ModBusRTU_TX.RegNum>>8;  //发送高8位读取数据个数码
		RS485.TX_BUFF[5]=ModBusRTU_TX.RegNum;      //发送低8位读取数据个数码
		RS485.TX_BUFF[6]=ModBusRTU_TX.ByteNum;      //发送低8位 字节数
		for(i=0;i<ModBusRTU_TX.ByteNum;i++)
		{
		  RS485.TX_BUFF[i+7]=ModBusRTU_TX.BUFF[i];
		}
		RS485.TX_BUFF[ModBusRTU_TX.ByteNum+7]=CRC16>>8;   //发送CRC高字节
		RS485.TX_BUFF[ModBusRTU_TX.ByteNum+8]=CRC16;      //发送CRC低字节
		RS485.ByteCnt=0;
	  RS485_Send(RS485.TX_BUFF,ModBusRTU_TX.ByteNum+9);
	}
	else
	{
	/*********************CRC计算****************************/	
		CRC16=0xFFFF;   //初使化为0xFFFF(必须是0xFFFF)
		CRC16^=ModBusRTU_TX.SlaveID;    //校验从机ID码
		CRC16=CRC16_ByteCheck(CRC16);
		CRC16^=ModBusRTU_TX.Function;     //校验功能码
		CRC16=CRC16_ByteCheck(CRC16);
		CRC16^=ModBusRTU_TX.Address>>8;     //校验高8位数据地址码
		CRC16=CRC16_ByteCheck(CRC16);
		CRC16^=ModBusRTU_TX.Address&0x00FF;     //校验低8位数据地址码
		CRC16=CRC16_ByteCheck(CRC16);
		CRC16^=ModBusRTU_TX.Word>>8;     //校验高8位数据码
		CRC16=CRC16_ByteCheck(CRC16);
		CRC16^=ModBusRTU_TX.Word&0x00FF;     //校验低8位数据码
		CRC16=CRC16_ByteCheck(CRC16);
		CRC16=((CRC16&0x00FF)<<8)|((CRC16&0xFF00)>>8);   //CRC高低字节互换
	/******************************************/
		RS485.TX_BUFF[0]=ModBusRTU_TX.SlaveID;    //发送设备ID码
		RS485.TX_BUFF[1]=ModBusRTU_TX.Function;    //发送功能码
		RS485.TX_BUFF[2]=ModBusRTU_TX.Address>>8;   //发送高8位数据地址码
		RS485.TX_BUFF[3]=ModBusRTU_TX.Address;      //发送低8位数据地址码
		RS485.TX_BUFF[4]=ModBusRTU_TX.Word>>8;      //发送高8位数据码
		RS485.TX_BUFF[5]=ModBusRTU_TX.Word;         //发送低8位数据码
		RS485.TX_BUFF[6]=CRC16>>8;                 //发送CRC高字节
		RS485.TX_BUFF[7]=CRC16;                    //发送CRC低字节
		RS485.ByteCnt=0;
	  RS485_Send(RS485.TX_BUFF,8);
	}
	RS485.ByteCnt=0;  //清0准备接收
	delay_ms(4); //帧间隔时间
}
void ModBusRTU_SendCmd(uint8_t *p,uint16_t len)
{
	uint16_t i;
	uint16_t CRC16;
	CRC16=CRC16_NBYTE(p,len);
	for(i=0;i<len;i++)
	{
	  RS485.TX_BUFF[i]=p[i];
	}
	RS485.TX_BUFF[i]=CRC16>>8;
	RS485.TX_BUFF[i+1]=CRC16;
	RS485_Send(RS485.TX_BUFF,len+2);
	RS485.ByteCnt=0;  //清0准备接收
	delay_ms(4); //帧间隔时间
}
#endif
















/*************************************************数据处理***********************************************************/
#if (USE_DigHand == 1)
/**************PID控制算法**************/
//(暂时未有)


/**************阶梯数字滤波算法**************/
double Ladder_last=0;
double Ladder(double step,double value)
{
  if((value-Ladder_last)>0)
	{
		if((value-Ladder_last)>=step) value=Ladder_last+step;
		else value=Ladder_last;
	}
	else if((value-Ladder_last)<0)
	{
		if((Ladder_last-value)>=step) value=Ladder_last-step;
		else value=Ladder_last;
	}
	Ladder_last=value;
  return value;
}
/***********带通数字滤波算法**************/
typedef struct 
{
  double Ek;
	double Ek_1;
	double Ea;
	double Ea_1;
}BANDPASS;
BANDPASS bandpass=
{
  .Ek=0,
	.Ek_1=0,
	.Ea=0,
	.Ea_1=0,
};

