Angle145/FSC_STOS/新版：FSC-OS/FSC-OS_V1.0.2_Beta_STM32F10x/User/STM32F10xPeripMode.h
double Growth_k(double km,double value)
{
  value=km*bandpass.Ek/bandpass.Ek_1*bandpass.Ek;
	return value;
}
double Growth_a(double km,double value)
{
  value=km*bandpass.Ea/bandpass.Ea_1*bandpass.Ea;
	return value;
}
double BandPass_M(double km,double max,double value) //过滤掉max以上的值
{
  if(value>max) value=Growth_k(km,value);
	bandpass.Ek_1=bandpass.Ek;
	return value;
}
double BandPass_L(double km,double min,double value) //过滤掉min以下的值
{
  if(value<min) value=Growth_k(km,value);
	bandpass.Ek_1=bandpass.Ek;
	return value;
}
double BandPass_ML(double km,double min,double max,double value) //过滤掉min以下的值且过滤掉max以上的值
{
  if((value>max)||(value<min)) value=Growth_k(km,value);
	bandpass.Ek_1=bandpass.Ek;
	return value;
}
double BandPass_MLN(double km,double min,double max,double value) //过滤掉min-max范围内的值
{
  if((value<max)&&(value>min)) 
	{
		if(value>=(max+min)/2) value=Growth_k(km,value);
		else  value=Growth_a(km,value);
	}
	if(value>=max) bandpass.Ek_1=bandpass.Ek;
	else if(value<=min) bandpass.Ea_1=bandpass.Ea;
	return value;
}

/******卡尔曼数字滤波算法***************************/
/*       
        Q:过程噪声，Q增大，动态响应变快，收敛稳定性变坏
        R:测量噪声，R增大，动态响应变慢，收敛稳定性变好       
*/
//卡尔曼滤波的两个参数

/* 卡尔曼滤波处理 */
double KalmanFilter(double ProcessNiose_Q,double MeasureNoise_R,const double ResrcData)
{
	  double R = MeasureNoise_R;
    double Q = ProcessNiose_Q;
	
    static double x_last;
    double x_mid = x_last;
    double x_now;

    static double p_last;
    double p_mid ;
    double p_now;

    double kg;

    x_mid=x_last;                       //x_last=x(k-1|k-1),x_mid=x(k|k-1)
    p_mid=p_last+Q;                     //p_mid=p(k|k-1),p_last=p(k-1|k-1),Q=噪声

    /*
     *  卡尔曼滤波的五个重要公式
     */
    kg=p_mid/(p_mid+R);                 //kg为kalman filter，R 为噪声
    x_now=x_mid+kg*(ResrcData-x_mid);   //估计出的最优值
    p_now=(1-kg)*p_mid;                 //最优值对应的covariance
    p_last = p_now;                     //更新covariance 值
    x_last = x_now;                     //更新系统状态值

    return x_now;

}

#endif

















/*************************************************ADC模数转换***********************************************************/
#if (USE_ADC == 1)
void ADC_Config(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x)
{
	  uint32_t RCC_APB2Periph_GPIOx;
	
		ADC_InitTypeDef ADC_InitStructure; 
		GPIO_InitTypeDef GPIO_InitStructure;

	  if(GPIOx==GPIOA) RCC_APB2Periph_GPIOx=RCC_APB2Periph_GPIOA;
	  else if(GPIOx==GPIOB) RCC_APB2Periph_GPIOx=RCC_APB2Periph_GPIOB;
	  else if(GPIOx==GPIOC) RCC_APB2Periph_GPIOx=RCC_APB2Periph_GPIOC;
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOx  |RCC_APB2Periph_ADC1, ENABLE );
	
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_x;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;	//模拟输入引脚
		GPIO_Init(GPIOx, &GPIO_InitStructure); 
	
		//使能ADC1通道时钟
		RCC_ADCCLKConfig(RCC_PCLK2_Div6);   
		//设置ADC分频因子6 72M/6=12,ADC最大时间不能超过14M
		ADC_DeInit(ADC1);  //复位ADC1,将外设 ADC1 的全部寄存器重设为缺省值

		ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;	//ADC工作模式:ADC1和ADC2工作在独立模式
		ADC_InitStructure.ADC_ScanConvMode = DISABLE;	//模数转换工作在单通道模式
		ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;	//模数转换工作在单次转换模式
		ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;	//转换由软件而不是外部触发启动
		ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;	//ADC数据右对齐
		ADC_InitStructure.ADC_NbrOfChannel = 1;	//顺序进行规则转换的ADC通道的数目
		ADC_Init(ADC1, &ADC_InitStructure);	//根据ADC_InitStruct中指定的参数初始化外设ADCx的寄存器   
			
		ADC_Cmd(ADC1, ENABLE);	//使能指定的ADC
		ADC_ResetCalibration(ADC1);	//使能复位校准  	 
		while(ADC_GetResetCalibrationStatus(ADC1));	//等待复位校准结束 
		ADC_StartCalibration(ADC1);	//开启AD校准
		while(ADC_GetCalibrationStatus(ADC1));	//等待校准结束 		 
 }

float ReadADC_Volt(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x)   
{
	uint8_t ch,t,times=10;   //每次读取10个数据，返回平均值
	float adsum=0;
	
	OSSchedLock();             //任务切换上锁
	if(GPIOx==GPIOA)
	{
	  switch(GPIO_Pin_x)
		{
			case GPIO_Pin_0: ch=0; break;
			case GPIO_Pin_1: ch=1; break;
			case GPIO_Pin_2: ch=2; break;
			case GPIO_Pin_3: ch=3; break;
			case GPIO_Pin_4: ch=4; break;
			case GPIO_Pin_5: ch=5; break;
			case GPIO_Pin_6: ch=6; break;
			case GPIO_Pin_7: ch=7; break;
			default: break;
		}
	}
	else if(GPIOx==GPIOB)
	{
		  switch(GPIO_Pin_x)
		{
			case GPIO_Pin_0: ch=8; break;
			case GPIO_Pin_1: ch=9; break;
			default: break;
		}
	}
	else if(GPIOx==GPIOC)
	{
	  switch(GPIO_Pin_x)
		{
			case GPIO_Pin_0: ch=10; break;
			case GPIO_Pin_1: ch=11; break;
			case GPIO_Pin_2: ch=12; break;
			case GPIO_Pin_3: ch=13; break;
			case GPIO_Pin_4: ch=14; break;
			case GPIO_Pin_5: ch=15; break;
			default: break;
		}
	}
  //设置指定ADC的规则组通道，一个序列，采样时间
	ADC_RegularChannelConfig(ADC1, ch, 1, ADC_SampleTime_239Cycles5 );	//ADC1,ADC通道,采样时间为239.5周期	 	
  for(t=0;t<times;t++)	
	{	
		ADC_SoftwareStartConvCmd(ADC1, ENABLE);	//使能指定的ADC1的软件转换启动功能
		while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC ));//等待转换结束
		adsum=adsum+ADC_GetConversionValue(ADC1);	//返回最近一次ADC1规则组的转换结果
	}
	adsum=(float)(adsum/times); //取平均值
	adsum=(float)(adsum*3.3/4095);
	OSSchedUnlock();      //任务切换解锁
	return adsum;
} 

uint16_t ReadADC_Hex(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x)   
{
   return (uint16_t)((ReadADC_Volt(GPIOx,GPIO_Pin_x)/3.3)*4095);
}

#endif



















/*******************************************DAC模块*******************************************************/
#if (USE_DAC == 1)
void DAC_Config(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x)	//DAC初始化
{
	GPIO_InitTypeDef GPIO_InitStructure;
	DAC_InitTypeDef DAC_InitStructure;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_AFIO,ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC,ENABLE);

	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_x;//DAC_1
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_AIN;//模拟量输入
	GPIO_Init(GPIOx,&GPIO_InitStructure);
	GPIO_SetBits(GPIOx,GPIO_Pin_x);//输出高
	
	DAC_InitStructure.DAC_Trigger=DAC_Trigger_None;//不使用触发功能
	DAC_InitStructure.DAC_WaveGeneration=DAC_WaveGeneration_None;//不使用三角波
	DAC_InitStructure.DAC_LFSRUnmask_TriangleAmplitude=DAC_LFSRUnmask_Bit0; //屏蔽 幅值设置
	DAC_InitStructure.DAC_OutputBuffer=DAC_OutputBuffer_Disable; //关闭缓存
	if(GPIO_Pin_x==GPIO_Pin_4)
	{
		DAC_Init(DAC_Channel_1,&DAC_InitStructure);//初始化DAC通道1
		DAC_Cmd(DAC_Channel_1,ENABLE);//使能DAC1
		DAC_SetChannel1Data(DAC_Align_12b_R,0);//12位 右对齐 写0数据
	}
	else 
	if(GPIO_Pin_x==GPIO_Pin_5)
	{
		DAC_Init(DAC_Channel_2,&DAC_InitStructure);//初始化DAC通道1
		DAC_Cmd(DAC_Channel_2,ENABLE);//使能DAC1
		DAC_SetChannel2Data(DAC_Align_12b_R,0);//12位 右对齐 写0数据
	}
}
void WriteDAC_Volt(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x,float volt)
{
	uint16_t temp;
	temp=(uint16_t)(volt*4095/3.3);
	if(GPIO_Pin_x==GPIO_Pin_4) DAC_SetChannel1Data(DAC_Align_12b_R,temp);
  else if(GPIO_Pin_x==GPIO_Pin_5) DAC_SetChannel2Data(DAC_Align_12b_R,temp);
}

