Angle145/FSC_STOS/新版：FSC-OS/FSC-OS_V1.0.2_Beta_STM32F10x/User/STM32F10xPeripMode.h
void WriteDAC_Hex(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin_x,uint16_t hex)
{
  if(GPIO_Pin_x==GPIO_Pin_4) DAC_SetChannel1Data(DAC_Align_12b_R,hex);
  else if(GPIO_Pin_x==GPIO_Pin_5) DAC_SetChannel2Data(DAC_Align_12b_R,hex);
}
#endif















/***************************************内部Flash读写**************************************************/
#if (USE_FLASHWR == 1)
/*--------------------------------Flash-------------------------------------*/
#define FLASH_ADDR_FLAG           0x08010000     //FLASH地址 - 标志位
#define FLASH_ADDR_DATA           0x08010002     //FLASH地址 - 数据
#define LENGTH_DATA               10             //数据长度
#define FLASH_PAGE_SIZE           ((uint16_t)0x800)        //页大小   - 2K
#define FLASH_TYPE_LENGTH         ((uint16_t)0x002)        //类型大小 - 2字节
#define FLASH_PAGE_LENGTH         (FLASH_PAGE_SIZE/FLASH_TYPE_LENGTH)
#define FLAG_OK                   0x00
#define FLAG_NOOK                 0x01

//uint8_t WriteBuf[LENGTH_DATA];                   //写入的数据
//uint8_t ReadBuf[LENGTH_DATA];                    //读出的数据
volatile FLASH_Status FLASHStatus = FLASH_COMPLETE;

void FLASH_WriteNWord(uint16_t* pBuffer, uint32_t WriteAddr, uint16_t nWord);
void FLASH_ReadNWord(uint16_t* pBuffer, uint32_t ReadAddr, uint16_t nWord);
/*------------------------------类型定义-------------------------------------*/
typedef enum {FAILED = 0, PASSED = !FAILED} TestStatus;
/*---------------------------------------------------------------------------*/
/************************************************
函数名称 ： FLASH_PageWrite
功    能 ： 写一页FLASH
参    数 ： pBuffer ----- 数据缓冲区
            WriteAddr --- 写地址
返 回 值 ： 无
*************************************************/
void FLASH_PageWrite(uint16_t *pBuffer, uint32_t WriteAddr) 
{
  uint16_t cnt_tmp;
	OSSchedLock();             //任务切换上锁 
  for(cnt_tmp=0; (cnt_tmp<FLASH_PAGE_LENGTH) && (FLASHStatus == FLASH_COMPLETE); cnt_tmp++)
  {
    FLASHStatus = FLASH_ProgramHalfWord(WriteAddr, *pBuffer);
    WriteAddr += 2;
    pBuffer++;
  }
	OSSchedUnlock();      //任务切换解锁
}

/************************************************
函数名称 ： FLASH_WriteNWord
功    能 ： 写N字节
参    数 ： pBuffer ----- 数据缓冲区
            WriteAddr --- 写地址
            nWord ------- 长度
返 回 值 ： 无
*************************************************/
void FLASH_WriteNWord(uint16_t *pBuffer, uint32_t WriteAddr, uint16_t nWord) //(用户可调用)
{
  static uint16_t buf_tmp[FLASH_PAGE_LENGTH];
  uint32_t NbrOfPage = 0x00;                     //页数（读写）

  uint32_t length_beyond_start;                  //开始页超出的长度(半字)
  uint32_t length_remain_start;                  //开始页剩余的长度(半字)

  uint32_t addr_first_page;                      //第一页(起始)地址
  uint32_t addr_last_page;                       //最后页(起始)地址
  uint16_t *pbuf_tmp;                            //buf指针
  uint16_t cnt_length;                           //计数 - 长度
  uint16_t cnt_page;                             //计数 - 页数
  uint32_t prog_addr_start;                      //编程地址
  uint32_t length_beyond_last;                   //最后页超出的长度(半字)
  uint8_t  flag_last_page_fill;                  //最后一页装满标志

  OSSchedLock();             //任务切换上锁 
  length_beyond_start = ((WriteAddr % FLASH_PAGE_SIZE) / FLASH_TYPE_LENGTH);
  length_remain_start = FLASH_PAGE_LENGTH - length_beyond_start;
  addr_first_page     = WriteAddr - (WriteAddr % FLASH_PAGE_SIZE);

  /* 擦除(写操作)的页数 */
  if(0 == (length_beyond_start + nWord)%FLASH_PAGE_LENGTH)
  {
    flag_last_page_fill = FLAG_OK;               //最后一页刚好
    NbrOfPage = (length_beyond_start + nWord) / FLASH_PAGE_LENGTH;
  }
  else
  {
    flag_last_page_fill = FLAG_NOOK;             //···跨页
    NbrOfPage = (length_beyond_start + nWord) / FLASH_PAGE_LENGTH + 1;
  }

  /* 解锁 */
  FLASH_UnlockBank1();

  /* 清除标志位 */
  FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR);

  /* 操作第一页 */
  FLASH_ReadNWord(buf_tmp, addr_first_page, FLASH_PAGE_LENGTH);
  FLASHStatus = FLASH_ErasePage(addr_first_page);
  /* 只有1页 */
  if(1 == NbrOfPage)
  {
    pbuf_tmp = pBuffer;                          //复制地址(指针)
    for(cnt_length=length_beyond_start; cnt_length<(length_beyond_start + nWord); cnt_length++)
    {
      buf_tmp[cnt_length] = *pbuf_tmp;
      pbuf_tmp++;
    }
    FLASH_PageWrite(buf_tmp, addr_first_page);
  }
  /* 大于1页 */
  else
  {
    /* 第一页 */
    pbuf_tmp = pBuffer;
    for(cnt_length=length_beyond_start; cnt_length<FLASH_PAGE_LENGTH; cnt_length++)
    {
      buf_tmp[cnt_length] = *pbuf_tmp;
      pbuf_tmp++;
    }
    FLASH_PageWrite(buf_tmp, addr_first_page);

    /* 最后一页刚好装满，不用读取最后一页数据 */
    if(FLAG_OK == flag_last_page_fill)
    {
      for(cnt_page=1; (cnt_page<NbrOfPage)  && (FLASHStatus == FLASH_COMPLETE); cnt_page++)
      {                                          //这里编程地址为字节地址(故FLASH_PAGE_SIZE)
        prog_addr_start = addr_first_page + cnt_page*FLASH_PAGE_SIZE;
        FLASHStatus = FLASH_ErasePage(prog_addr_start);
                                                 //(cnt_page - 1):为下一页地址
        FLASH_PageWrite((pBuffer + length_remain_start + (cnt_page - 1)*FLASH_PAGE_LENGTH), prog_addr_start);
      }
    }
    else
    {
      /* 中间页 */
      for(cnt_page=1; (cnt_page<(NbrOfPage - 1))  && (FLASHStatus == FLASH_COMPLETE); cnt_page++)
      {                                          //这里编程地址为字节地址(故FLASH_PAGE_SIZE)
        prog_addr_start = addr_first_page + cnt_page*FLASH_PAGE_SIZE;
        FLASHStatus = FLASH_ErasePage(prog_addr_start);
                                                 //(cnt_page - 1):为下一页地址
        FLASH_PageWrite((pBuffer + length_remain_start + (cnt_page - 1)*FLASH_PAGE_LENGTH), prog_addr_start);
      }

      /* 最后一页 */
      addr_last_page = addr_first_page + (NbrOfPage - 1)*FLASH_PAGE_SIZE;

      FLASH_ReadNWord(buf_tmp, addr_last_page, FLASH_PAGE_LENGTH);
      FLASHStatus = FLASH_ErasePage(addr_last_page);
                                                 //NbrOfPage - 2: 首页 + 最后一页 共两页(-2)
      pbuf_tmp = pBuffer + length_remain_start + (NbrOfPage - 2)*(FLASH_PAGE_SIZE/2);
      length_beyond_last   = (nWord - length_remain_start) % FLASH_PAGE_LENGTH;
      for(cnt_length=0; cnt_length<length_beyond_last; cnt_length++)
      {
        buf_tmp[cnt_length] = *pbuf_tmp;
        pbuf_tmp++;
      }
      FLASH_PageWrite(buf_tmp, addr_last_page);
    }
  }
	OSSchedUnlock();      //任务切换解锁
}

/************************************************
函数名称 ： FLASH_ReadNWord
功    能 ： 读N字节
参    数 ： pBuffer ----- 数据缓冲区
            ReadAddr ---- 读地址
            nWord ------- 长度
返 回 值 ： 无
*************************************************/
void FLASH_ReadNWord(uint16_t* pBuffer, uint32_t ReadAddr, uint16_t nWord) //(用户可调用)
{
	OSSchedLock();             //任务切换上锁 
  while(nWord--)
  {
    *pBuffer = (*(__IO uint16_t*)ReadAddr);
    ReadAddr += 2;
    pBuffer++;
  }
	OSSchedUnlock();      //任务切换解锁
}
#endif












/*************************************************程序看门狗***********************************************************/
/**
 * 初始化独立看门狗（时钟：大概40KHZ）
 * prer:分频数:0~7(只有低 3 位有效!)
 * 分频因子=4*2^prer.但最大值只能是 256!
 * rlr:重装载寄存器值:低 11 位有效.
 * 时间计算(大概):Tout=((4*2^prer)*rlr)/40 (ms).
 */
#if (USE_IWDG == 1)
void IWDG_Config(uint16_t nms) //单位：ms
{
	uint8_t i=0,prersum=1;
  uint8_t prer=4;       //默认使用时钟: 40KHz/(4*2^4) = 625Hz =1.6ms
	uint16_t rlr;     
	while(i<2+prer) { prersum*=2; i++;}
	rlr=nms*40/prersum;
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable); /* 使能对寄存器IWDG_PR和IWDG_RLR的写操作*/
	IWDG_SetPrescaler(prer);    /*设置IWDG预分频值:设置IWDG预分频值*/
	IWDG_SetReload(rlr);     /*设置IWDG重装载值*/
	IWDG_ReloadCounter();    /*按照IWDG重装载寄存器的值重装载IWDG计数器*/
	IWDG_Enable();        /*使能IWDG*/
}
void IWDG_Feed(void)  //独立看门狗 - 喂狗
{
  IWDG_ReloadCounter(); 
}
#endif












/*************************************************BKP掉电保存***********************************************************/
/*****************************************************************
*断电检测
*EXTI_InitStructure.EXTI_Trigger的赋值可选项： 
*       EXTI_Trigger_Rising---表示电压从高下降到低于设定阀值时产生中断； 
*       EXTI_Trigger_Falling---表示电压从低上升到高于设定阀值时产生中断； 
*       EXTI_Trigger_Rising_Falling---表示电压上升或下降越过设定阀值时都产生中断。 
*
*当工作电压低于设定阀值时，将产生PVD中断，在中断程序中进行相应的处理： 
*电压阀值： (2.2V-2.9V)

            2.2V   PWR_PVDLevel_2V2                
            2.3V   PWR_PVDLevel_2V3                  
            ...    ...       
            2.9V   PWR_PVDLevel_2V9       
                   IS_PWR_PVD_LEVEL(LEVEL)
******************************************************************/
#if (USE_BKP == 1)
void BKP_Config(float voltage)  //(用户可调用)
{
	uint32_t VolLimit;
  EXTI_InitTypeDef EXTI_InitStructure;
	voltage=voltage*10;
	switch((uint8_t)voltage)
	{
	  case 22:  VolLimit=PWR_PVDLevel_2V2; break;
		case 23:  VolLimit=PWR_PVDLevel_2V3; break;
		case 24:  VolLimit=PWR_PVDLevel_2V4; break;
		case 25:  VolLimit=PWR_PVDLevel_2V5; break;
		case 26:  VolLimit=PWR_PVDLevel_2V6; break;
		case 27:  VolLimit=PWR_PVDLevel_2V7; break;
		case 28:  VolLimit=PWR_PVDLevel_2V8; break;
		case 29:  VolLimit=PWR_PVDLevel_2V9; break;
		default:  break;
	}	
  PWR_PVDLevelConfig(VolLimit); // 设定监控阀值 
  PWR_PVDCmd(ENABLE); // 使能PVD  
  EXTI_StructInit(&EXTI_InitStructure);  
  EXTI_InitStructure.EXTI_Line = EXTI_Line16; // PVD连接到中断线16上  
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt; //使用中断模式  
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;//电压低于阀值时产生中断  
  EXTI_InitStructure.EXTI_LineCmd = ENABLE; // 使能中断线  
  EXTI_Init(&EXTI_InitStructure); // 初始化  
}

#endif






















