Angle145/FSC_STOS/新版：FSC-OS/FSC-OS_V1.0.2_Beta_STM32F10x/User/STM32F10xPeripMode.h
/*****************************************STM32中断函数********************************************

*提示：中断触发后会打断所有任务运行，然后转移到此处对应的中断函数运行，运行完此处的函数会返回
       被打断的任务处继续运行，所以为了任务不被打断太久，建议中断函数处理的内容尽量不要使用延
       时(代码可以多，但尽量不要使用延时)
*说明：

*********************************************************************************************/
void TIM1_IRQHandler(void)	  //定时器1中断函数 (高级定时器)  //定时时间到产生中断
{
	TIM_ClearITPendingBit(TIM1,TIM_IT_Update);
	#if (USE_PWM == 0)          //使用PWM时，用作普通定时无效
	// 用户添加定时器1的中断代码 
	/*************************/



	/**************************/	
	#endif
}

void TIM2_IRQHandler(void)	  //定时器2中断函数 (标准(通用)定时器)  //定时时间到产生中断
{
#if (USE_FREQMETER==1)        
	FreqMeterTIM2_IRQHandler();
#else                         // 使用频率计时, 用作普通定时无效
	TIM_ClearITPendingBit(TIM2,TIM_IT_Update);
	// 用户添加定时器2的中断代码 
	/*************************/



	/**************************/	
#endif
}
void TIM3_IRQHandler(void)	  //定时器3中断函数 (标准(通用)定时器)  //定时时间到产生中断
{
	TIM_ClearITPendingBit(TIM3,TIM_IT_Update);
	// 用户添加定时器3的中断代码 
	/*************************/

  

	/**************************/	
}
void TIM4_IRQHandler(void)	  //定时器4中断函数 (标准(通用)定时器)  //定时时间到产生中断
{
	TIM_ClearITPendingBit(TIM4,TIM_IT_Update);
	// 用户添加定时器4的中断代码 
	/*************************/

  

	/**************************/	
}

void EXTI0_IRQHandler(void)	   //外部中断函数                    中断引脚0   //外部引脚0检测到触发电平时产生中断，其他引脚同理
{
	if(EXTI_GetITStatus(EXTI_Line0)==SET) //检查中断标志位是否置1
	{
   	EXTI_ClearITPendingBit(EXTI_Line0);//清除EXTI线路挂起位
		// 用户添加引脚0的中断代码 
		/*************************/



		/**************************/	
	}		
}
void EXTI1_IRQHandler(void)	   //外部中断函数                    中断引脚1  
{
	if(EXTI_GetITStatus(EXTI_Line1)==SET) //检查中断标志位是否置1
	{
   	EXTI_ClearITPendingBit(EXTI_Line1);//清除EXTI线路挂起位
		// 用户添加引脚1的中断代码 
		/*************************/



		/**************************/	
	}		
}
void EXTI2_IRQHandler(void)	   //外部中断函数                     中断引脚2   
{
	if(EXTI_GetITStatus(EXTI_Line2)==SET) //检查中断标志位是否置1
	{
   	EXTI_ClearITPendingBit(EXTI_Line2);//清除EXTI线路挂起位
		// 用户添加引脚2的中断代码 
		/*************************/



		/**************************/	
	}		
}
void EXTI3_IRQHandler(void)	   //外部中断函数                     中断引脚3   
{
	if(EXTI_GetITStatus(EXTI_Line3)==SET) //检查中断标志位是否置1
	{
   	EXTI_ClearITPendingBit(EXTI_Line3);//清除EXTI线路挂起位
		// 用户添加引脚3的中断代码 
		/*************************/



		/**************************/		
	}		
}
//void EXTI4_IRQHandler(void)	   //外部中断函数                     中断引脚4   
//{
//	if(EXTI_GetITStatus(EXTI_Line4)==SET) //检查中断标志位是否置1
//	{
//   	EXTI_ClearITPendingBit(EXTI_Line4);//清除EXTI线路挂起位
//		// 用户添加引脚4的中断代码 
//		/*************************/



//		/**************************/		
//	}		
//}
void EXTI9_5_IRQHandler(void)	   //外部中断函数   引脚5~9   
{
	if(EXTI_GetITStatus(EXTI_Line5)==SET) //检查中断标志位是否置1   中断引脚5   
	{
   	EXTI_ClearITPendingBit(EXTI_Line5);//清除EXTI线路挂起位
		// 用户添加引脚5的中断代码 
		/*************************/

		

		/**************************/	
	}	

	if(EXTI_GetITStatus(EXTI_Line6)==SET) //检查中断标志位是否置1    中断引脚6   
	{
   	EXTI_ClearITPendingBit(EXTI_Line6);//清除EXTI线路挂起位
		// 用户添加引脚6的中断代码 
		/*************************/



		/**************************/		
	}	
 
	if(EXTI_GetITStatus(EXTI_Line7)==SET) //检查中断标志位是否置1    中断引脚7   
	{
   	EXTI_ClearITPendingBit(EXTI_Line7);//清除EXTI线路挂起位
		// 用户添加引脚7的中断代码 
		/*************************/



		/**************************/		
	}	

	if(EXTI_GetITStatus(EXTI_Line8)==SET) //检查中断标志位是否置1    中断引脚8   
	{
   	EXTI_ClearITPendingBit(EXTI_Line8);//清除EXTI线路挂起位
		// 用户添加引脚8的中断代码 
		/*************************/



		/**************************/			
	}	

	if(EXTI_GetITStatus(EXTI_Line9)==SET) //检查中断标志位是否置1    中断引脚9   
	{
   	EXTI_ClearITPendingBit(EXTI_Line9);//清除EXTI线路挂起位
		// 用户添加引脚9的中断代码 
		/*************************/



		/**************************/				
	}		
}
void EXTI15_10_IRQHandler(void)	   //外部中断函数   引脚10~15 
{ 
	if(EXTI_GetITStatus(EXTI_Line10)==SET) //检查中断标志位是否置1   中断引脚10   
	{
   	EXTI_ClearITPendingBit(EXTI_Line10);//清除EXTI线路挂起位
		// 用户添加引脚10的中断代码 
		/*************************/



		/**************************/				
	}		
	
	if(EXTI_GetITStatus(EXTI_Line11)==SET) //检查中断标志位是否置1   中断引脚11   
	{
   	EXTI_ClearITPendingBit(EXTI_Line11);//清除EXTI线路挂起位
		// 用户添加引脚11的中断代码 
		/*************************/



		/**************************/				
	}		
	
	if(EXTI_GetITStatus(EXTI_Line12)==SET) //检查中断标志位是否置1   中断引脚12   
	{
   	EXTI_ClearITPendingBit(EXTI_Line12);//清除EXTI线路挂起位
		// 用户添加引脚12的中断代码 
		/*************************/



		/**************************/			
	}		
	
	if(EXTI_GetITStatus(EXTI_Line13)==SET) //检查中断标志位是否置1   中断引脚13   
	{
   	EXTI_ClearITPendingBit(EXTI_Line13);//清除EXTI线路挂起位
		// 用户添加引脚13的中断代码 
		/*************************/



		/**************************/				
	}		
	
	if(EXTI_GetITStatus(EXTI_Line14)==SET) //检查中断标志位是否置1   中断引脚14   
	{
   	EXTI_ClearITPendingBit(EXTI_Line14);//清除EXTI线路挂起位
		// 用户添加引脚14的中断代码 
		/*************************/



		/**************************/				
	}		
	
	if(EXTI_GetITStatus(EXTI_Line15)==SET) //检查中断标志位是否置1   中断引脚15  
	{
   	EXTI_ClearITPendingBit(EXTI_Line15);//清除EXTI线路挂起位
		// 用户添加引脚15的中断代码 
		/*************************/



		/**************************/		
	}		
}

void USART1_IRQHandler(void)  //串口1中断  PA9(TX) PA10(RX) //接收到新字节时产生中断
{
	uint8_t UsartRxdata;
	
	#ifdef USE_USART  //STM32F10x重封装库USART1模块接收检测
  STM32F10xPeripMode_Usart1RxCheck();    
	#endif
	
  if(USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)  //检查指定的USART中断发生与否
	{
    UsartRxdata= USART1_ReadByte();	//串口接收1字节数据
		USART_ClearFlag(USART1, USART_FLAG_RXNE);    //清除接收中断标志
    USART_ClearITPendingBit(USART1, USART_IT_RXNE); //以下为自带的接收缓存,在示例说明TXT里有使用说明	
		
		#ifdef USE_USART  //STM32F10x重封装库USART1模块
		#if (USE_USART == MODE_USE)	
		STM32F10xPeripMode_Usart1_UsartReceiveByte(UsartRxdata);
		#endif
		#endif
		
#if (printf_use_usartx == 1)		
		//系统指令函数//	
		//OSCmdRxByte(UsartRxdata); //使用串口1作为系统指令(放在串口1中断里就使用串口1，放在其他的就使用其他的串口)
#endif		
		// 用户添加串口1接收中断代码 
		/*************************/	


		/**************************/	    	
	}
}
void USART2_IRQHandler(void)  //串口2中断  PA2(TX) PA3(RX) //接收到新字节时产生中断
{
	uint8_t UsartRxdata;
	
