Angle145/FSC_STOS/新版：FSC-OS/FSC-OS_V1.0.2_Beta_STM32F10x/User/STM32F10xPeripMode.h
	#ifdef USE_USART  //重封装库USART2模块接收检测
  STM32F10xPeripMode_Usart2RxCheck();   
	#endif
	
  if(USART_GetITStatus(USART2, USART_IT_RXNE) != RESET)  //检查指定的USART中断发生与否
	{       
		UsartRxdata= USART2_ReadByte();	//串口接收1字节数据
		USART_ClearFlag(USART2, USART_FLAG_RXNE);    //清除接收中断标志
    USART_ClearITPendingBit(USART2, USART_IT_RXNE); //以下为自带的接收缓存,在示例说明TXT里有使用说明
		
		#ifdef USE_USART //STM32F10x重封装库USART2模块
		#if (USE_USART == MODE_USE)	
		STM32F10xPeripMode_Usart2_UsartReceiveByte(UsartRxdata);
		#endif
		#endif	
		
		#ifdef USE_MODEBUS //STM32F10x重封装库ModeBus模块
		#if (USE_MODEBUS == MODE_USE)
		STM32F10xPeripMode_ModeBusRTU_UsartReceiveByte(UsartRxdata);	
		#endif	
		#endif
		
#if (printf_use_usartx == 2)		
		//系统指令函数//		
		OSCmdRxByte(UsartRxdata); //使用串口1作为系统指令(放在串口1中断里就使用串口1，放在其他的就使用其他的串口)
#endif
		// 用户添加串口2接收中断代码 
		/*************************/


		/**************************/	
	}
}
void USART3_IRQHandler(void)  // 串口3中断  PB10(TX) PB11(RX) //接收到新字节时产生中断
{
	uint8_t UsartRxdata;
	
	#ifdef USE_USART  //STM32F10x重封装库USART3模块接收检测
  STM32F10xPeripMode_Usart3RxCheck(); 
  #endif  
	
  if(USART_GetITStatus(USART3, USART_IT_RXNE) != RESET) 
	{    
    UsartRxdata= USART3_ReadByte();	//串口接收1字节数据		
		USART_ClearFlag(USART3, USART_FLAG_RXNE);   
    USART_ClearITPendingBit(USART3, USART_IT_RXNE); //以下为自带的接收缓存,在示例说明TXT里有使用说明
		
		#ifdef USE_USART
		#if (USE_USART == MODE_USE)	 //STM32F10x重封装库USART3模块
		STM32F10xPeripMode_Usart3_UsartReceiveByte(UsartRxdata);
		#endif
		#endif
		
#if (printf_use_usartx == 3)		
		//系统指令函数//	
		OSCmdRxByte(UsartRxdata); //使用串口1作为系统指令(放在串口1中断里就使用串口1，放在其他的就使用其他的串口)
#endif		
		// 用户添加串口3接收中断代码 
		/*************************/



		/**************************/	
	}
}


/*****************************************************************
*PVD中断,掉电中断函数
*如需要使用请在任务初使化里调用BKP_Config();后此中断即可生效
*****************************************************************/
void PVD_IRQHandler(void)  
{ 
  EXTI_ClearITPendingBit(EXTI_Line16); 
   // 用户添加掉电紧急保存数据代码 
	/*************************/
	
	
	
	/**************************/
}
/************************************************************************************/


#endif


